-- --------------------------------------------------------
-- ホスト:                          10.102.12.81
-- サーバーのバージョン:                   8.0.32-24 - Percona Server (GPL), Release '24', Revision 'e5c6e9d2'
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               12.8.0.6908
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- futaba_ok2_shippment のデータベース構造をダンプしています
CREATE DATABASE IF NOT EXISTS `futaba_ok2_shippment` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `futaba_ok2_shippment`;

--  テーブル futaba_ok2_shippment.m_error の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_error` (
  `error_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラーコード',
  `error_category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラー種別',
  `error_summary` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラー概要',
  `error_operation` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラー対応',
  `error_description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラー詳細',
  `rms_error_code` bit(50) DEFAULT (0) COMMENT 'RMSエラーコード',
  `error_level` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0' COMMENT 'エラーレベル',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時(yyyy/MM/dd hh:mm:ss)',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '変更日時(yyyy/MM/dd hh:mm:ss)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_error: ~204 rows (約) のデータをダンプしています
DELETE FROM `m_error`;
INSERT INTO `m_error` (`error_code`, `error_category`, `error_summary`, `error_operation`, `error_description`, `rms_error_code`, `error_level`, `created_date`, `updated_date`) VALUES
	('E1101001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '無効な地図データ', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1101002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'マップの初期化に失敗しました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1102001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'ワークステーションのデータは違法です', b'01110001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1102002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'ワークステーションの初期化に失敗しました', b'01110010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1103001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '充電ステーションのデータは違法です', b'01011001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1103002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '充電ステーションの初期化に失敗しました', b'01011010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1104001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'ロボットモデルデータは違法です', b'01000001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1104002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'ロボットモデルの初期化に失敗しました', b'01000010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1105001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'ファンクションセルデータが無効です', b'00101001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1105002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '関数セルの初期化に失敗しました', b'00101010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1106002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '拡張解析の初期化に失敗しました', b'00010010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1107001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', '無効なシェルフデータ', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1107002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'シェルフの初期化に失敗しました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1108001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'コンテナに関連する無効なデータ', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1108002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'コンテナ関連の初期化に失敗しました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1109001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'フォークリフトパレット関連のデータは違法です', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1109002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'フォークリフトパレット関連の初期化に失敗しました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1110001', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'エレベーターに関するデータは不正です。', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E1110002', 'AMR', 'AMR初期化異常', 'RCSメーカーへお問い合わせください。', 'エレベーター関連初期化に失敗しました。', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112000', 'AMR', 'AMRタスク異常', 'AMRの電源を入れなおしてください', 'ロボットと接続することができません。', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112001', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'サブタスク送信時タイムアウト', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112002', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ルート設定が失敗しました。', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112003', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットがマップ上にいない', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112004', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'タスクのスタート位置もしくは目的地には障害物がある', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112005', 'AMR', 'AMRタスク異常', '進路上の障害物を退避してください。', '通路に障害物（ロボットまたは棚）がある', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112006', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ルートのリソースが占用されているかもしれません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112007', 'AMR', 'AMRタスク異常', '設定可能なルートを再設定して下さい。', '設定可能なルートがありません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112009', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットは時間の経過とともに棚の行動をとります', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112010', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '棚の位置に到達せずに棚を取る', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112011', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '長い間待たなかった', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112012', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットのパワーが長時間増加しない', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112013', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットが低電力比を達成', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112014', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電ステーションに一致しないと充電タスクを実行できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112015', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'アイドル状態の充電ステーションがないと、充電タスクを実行できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112016', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '利用可能な充電ステーションがないため、充電タスクを実行できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112017', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電ステーションのセルは他のロボットによって占有されています', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112018', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '地域を越えた充電に失敗しました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112019', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'フロア間の充電が失敗する', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112020', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '現在のタスクはブロックされており、課金タスクは実行できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112021', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '現在のタスクは完了しておらず、充電タスクを実行できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112022', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電時間が長すぎる', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112023', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットのバッテリーが高すぎます', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112024', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '経由地が見つかりません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112025', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットがロックされています', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E112026', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', 'ロボットのバッテリー温度が低すぎます', b'01110111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113000', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電ステーション接続失敗', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113001', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電ステーションオフライン', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113002', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電スタンドコマンドタイムアウトの送信を開始します', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113003', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電スタンド終了コマンド送信タイムアウト', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113004', 'AMR', 'AMRタスク異常', 'RCSメーカーへお問い合わせください。', '充電に失敗したロボットが多すぎます', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113005', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電パイルの再起動', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113006', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電パイルアップグレード', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E113007', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電杭が無効になっています', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E114000', 'AMR', 'AMRシステム警報', 'コタツの位置更新を行ってください', '棚の位置は更新が必要です', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E116000', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボットが異常です。ロボットのライトストリップの色に従って問題を確認してください', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121000', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ターミナルQRコードの位置の横方向のずれ> 20mm;角度が2°より大きい', b'00001000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121001', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '直線移動角偏差が3°を超える', b'00001001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121002', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '積分回転角度とエンコーダー角度の差が限界を超えている', b'00001010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121003', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボットの中心位置のずれが制限を超えている', b'00001011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121004', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '回転すると駆動輪が滑る', b'00001100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121005', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '制御コマンドの方向と実際の角度回転方向に一貫性がありません。例：命令が間違っている可能性があり、負荷が大きすぎる可能性があります', b'00001101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121006', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ポイントに基づいて円弧をフィッティングすると、軌道の滑らかさの累積誤差が制限を超えます', b'00001110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121007', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'キャラクターグリッドシーンに入ると、目標姿勢と停止姿勢の誤差が限界を超えています', b'00001111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121008', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '回転棚角度が180°を超える', b'00010000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121009', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'シェルフQRコードとグラウンドQRコードの相対誤差が制限を超えています', b'00010001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121010', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '棚を持ち上げるとき', b'00010010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121011', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボット停止モードでのジャイロ積分検出。たとえば、ロボットが停止しているときにロボットが外力で回転すると、エラーが報告される場合があります', b'00010011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121012', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボット停止モードでの画像融合角度変化検出。たとえば、ロボットが停止しているときにロボットが外力で回転すると、エラーが報告される場合があります', b'00010100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121013', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボット停止モードでのエンコーダ角度変化検出。たとえば、ロボットが停止しているときにロボットが外力で回転すると、エラーが報告される場合があります', b'00010101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121014', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボットが充電ステーションまで歩くとき、位置偏差xy座標は20mmです', b'00010110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121015', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '充電ステーションの位置xy偏差、ポイント座標全体20mm', b'00010111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121016', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '充電後の方向が間違っている', b'00011000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121017', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '持ち上げ中の高さパラメータが正しくない', b'00011001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121018', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '下降時に高さパラメータが正しくない', b'00011010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121019', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロボットの現在のポイントとパスの開始位置が制限を超えています', b'00011011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121020', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '回転時に棚を調整します。棚の位置が比較的悪いです。', b'00011100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121021', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '棚を持ち上げるとき', b'00011101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121022', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '2つ以上の地上QRコードを紛失した', b'00011110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121023', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'dspデータの取得ceilrectタイムアウト', b'00011111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121024', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'dspデータセルデコードタイムアウトを取得する', b'00100000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121025', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '小さな道を計画するときの間違った角度', b'00100001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121026', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '手動モードでタスクを実行するためのエラーを受け取りました', b'00100010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121027', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '充電に失敗しました', b'00100011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121028', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '歩行中、上の棚のQRコードは視野にありません', b'00100100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121029', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'QRコードナビゲーションを切り替えた後、最初の地上QRコードを踏むことができません', b'00100101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121030', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '運動中に車輪が滑る', b'00100110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121031', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'シェルフモデルの異常な識別', b'00100111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121032', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '緊急停止スイッチトリガー', b'00101000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121033', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '手動モードに入った?', b'00101001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121034', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '障害物回避ボックス/ホストコンピュータが障害物回避センサーデータを受信しない', b'00101010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121035', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '障害物回避ボックスとメインコントロール間の通信リンクが異常', b'00101011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121036', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '障害物回避ボックス/ホストコンピューターが誤った障害物回避センサーデータを受信する', b'00101100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121037', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '電源ボックスとメインコントロール間の通信リンクの異常', b'00101101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121038', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '電源ボックスが間違ったバッテリーデータを受信した', b'00101110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121039', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'CAN1通信障害。例：400ミリ秒以内にデータが受信されない', b'00101111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121040', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'CAN2通信障害。例：400ミリ秒以内にデータが受信されない', b'00110000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121041', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブが失われました', b'00110001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121042', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'エンコーダーの損失', b'00110010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121043', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'DSPが接続を失いました。例：DSPデータが40秒以内に受信されない', b'00110011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121044', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ジャイロの温度変化が大きすぎる', b'00110100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121045', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ジャイロの変更前後の2つのキャリブレーションの基準値が大きく変化している', b'00110101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121046', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '回転すると駆動輪が滑る', b'00110110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121047', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '2秒以内に障害物回避データの更新を受信しません', b'00110111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121048', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '200秒以内にバッテリーデータの更新が受信されない', b'00111000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121049', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブホイールがロックされています。例：直線、円弧、回転などのモーションモードで、2秒以上動かない場合は、駆動輪がロックされていると見なされます。', b'00111001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121050', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '左輪が一直線に滑る', b'00111010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121051', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '直進すると右輪が滑る', b'00111011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121052', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '画像保存時のエラー：地面の2次元コードのキャリブレーションエラー> 10°、サイドエラー> 4cm', b'00111100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121053', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '次のような非QRコード領域での画像フィードバック：コードが失われたときのエラー', b'00111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121054', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'リフティングモーターは持ち上げられません。例：持ち上げ状態でパレットが20秒以内に持ち上げられない場合、エラーが報告されます', b'00111110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121055', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブホイールエンコーダパルスの数は更新されていません。例：線形またはアークモーションでのエンコーダの障害', b'00111111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121056', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブホイールエンコーダーのパルス数がオーバーフローする、つまりカウントが上限を超える', b'01000000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121057', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'フロントバンパートリガー', b'01000001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121058', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'シェルフのQRコードが正しくデコードされていません。例：ブラックボックスは解決されましたが、コード値が間違っています', b'01000010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121059', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'リアバンパートリガー', b'01000011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121060', 'AMR', 'AMR本体異常', 'AMR周辺の障害物を取り除いてください。', 'バンパーセンサーが反応した', b'01000100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121061', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'カメラによってアップロードされた画像データは、頭と尾の検証を解析できませんでした', b'01000101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121062', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'カメラによってアップロードされた画像データの頭と尾のチェックサムの解析に失敗しました', b'01000110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121063', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '電流なしで充電', b'01000111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121064', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '充電センサーの故障', b'01001000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121065', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '2秒以内の障害物回避の元のデータは更新されません', b'01001001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121066', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '駆動輪充電過電流', b'01001010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121067', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブホイールモーターの過電流', b'01001011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121068', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'リフトモーターの過電流', b'01001100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121069', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'DSPはハートビートを失い、正しいQRコード位置にフィードバックがありません', b'01001101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121070', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'DSPデータフィードバックエラー', b'01001110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121071', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'シェルフのQRコードのデコードに失敗しました。例：ブラックボックスでさえ解決されない', b'01001111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121072', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'QRコードのデコードタイムアウト', b'01010000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121073', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブオーバー温度', b'01010001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121074', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'Lidarデータの損失、またはデバイスの障害', b'01010010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121075', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'バッテリーデータの損失', b'01010011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121076', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'バッテリー過熱保護', b'01010100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121077', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'モーターモジュールの回復可能な障害', b'01010101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121078', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'モーターモジュールの回復不能な故障（交換）', b'01010110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121079', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '絶対エンコーダーバッテリーが少ない', b'01010111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121080', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ロードセルデータの損失', b'01011000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121081', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '主制御と産業制御の通信が中断されます', b'01011001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121082', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'タスクステートマシンの切り替えエラー', b'01011010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121083', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'タスクの最後に間違った指示を与える', b'01011011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121084', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'タスクステップステージエラー', b'01011100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121085', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブコマンドエラー', b'01011101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121086', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブモーターの位相エラー', b'01011110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121087', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブトラッキングエラー', b'01011111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121088', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブフィードバックエラー', b'01100000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121089', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '駆動不足電圧', b'01100001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121090', 'AMR', 'AMR本体異常', 'AMRの電源を入れなおしてください。', 'ドライブの過電圧', b'01100010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121091', 'AMR', 'AMR本体異常', 'AMRの電源を入れなおしてください。', 'ドライブオーバーカレント', b'01100011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121092', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '駆動電流短絡', b'01100100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121093', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブモーターの温度が高すぎる', b'01100101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121094', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブモーターの温度が低すぎる', b'01100110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121095', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブ温度が高すぎる', b'01100111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121096', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブ温度が低すぎる', b'01101000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121097', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブオーバースピードアラーム', b'01101001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121098', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブアドレスエラー', b'01101010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121099', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'コンポーネント配信の例外?', b'01101011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121100', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'コンポーネントの受け取りが異常です', b'01101100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121101', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'コンポーネントの通信が中断されました', b'01101101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121102', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'コンポーネントの障害', b'01101110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121103', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '深度カメラのデータ損失', b'01101111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121104', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '魚眼カメラのデータ損失', b'01110000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121105', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ネットワークの中断', b'01110001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121106', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'ドライブのデータ損失、またはデバイス障害', b'01110010', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121107', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', 'トリガーSTO', b'01110011', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121108', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '押すとブレーキが解除されます', b'01110100', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121109', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '電池切れ', b'01110101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121110', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '計量過負荷または部分荷重が限界を超えています', b'01110110', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E121111', 'AMR', 'AMR本体異常', 'RCSメーカーへお問い合わせください。', '場所の喪失', b'01110111', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122000', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'RMS通信が中断されました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122001', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'CAN通信が中断されました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122002', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '画面の通信が中断されました', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122003', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'RMSデータ異常', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122004', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'RMSコマンドの例外', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122005', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'フォークリフト充電ステーションが緊急停止を押す', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122006', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', 'フォークリフト充電ステーションはセンサーを検出しません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122007', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '過熱した充電モジュール', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122008', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '自動モードでの充電電流は0です', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122009', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電モジュールの警告ステータス', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122010', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電モジュールのエラーステータス', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E122011', 'AMR', 'AMR充電異常', 'RCSメーカーへお問い合わせください。', '充電ステーションは利用できません', b'11111101', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E181000', 'AMR', 'AMRシステム異常', 'RCSメーカーへお問い合わせください。', 'ロボットの平均パワーが低い', b'01101000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E181001', 'AMR', 'AMRシステム異常', 'RCSメーカーへお問い合わせください。', 'エリアに急停止が発生しました', b'01101001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E191000', 'AMR', 'AMRシステム警報', 'RCSメーカーへお問い合わせください。', '緊急停止ボタンが押されました', b'01111000', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E191001', 'AMR', 'AMRシステム警報', 'RCSメーカーへお問い合わせください。', '切断する緊急停止ボタン', b'01111001', 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E200001', 'CONNECTION', 'RMS通信異常', 'RMSサーバーを再起動してください。', 'RMSサーバとの通信に失敗しました', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E200002', 'CONNECTINO', '進度ナビ通信異常', '進度ナビとの通信経路を確認してください。', '進度ナビとの通信に失敗しました', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300001', 'LOGIC', 'AMR搬送処理中異常', 'WCS側システムログを確認してください。', 'AMR搬送処理中異常', NULL, 'ERROR', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300002', 'LOGIC', 'サイクルタイムオーバー', 'サイクルタイムオーバー', 'サイクルタイムオーバー', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300101', 'LOGIC', '搬送先不足', 'コタツ移動などで搬送先を空けてください。', ' 選択した搬送タスクに割り当てる搬送先がありません', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300102', 'LOGIC', '搬送先間口不足', 'コタツ移動などで搬送先を空けてください。', '選択した搬送タスクに割り当てる搬送先間口セルがあrません', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300201', 'LOGIC', '空きコタツ数不足', 'パレット抜き取りなどを実施し、空きコタツを用意してください。', 'ストア内に空きコタツが不足しています', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300221', 'LOGIC', '品番が存在しない', '品番マスタを登録してください', '進度ナビから指示の入った品番が品番マスタに存在しない', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E300400', 'LOGIC', '空パレコタツ発進失敗', 'コタツのデータ上高さまたは位置トランザクションのタスク追加フラグを確認してください。', '工程1空投入間口からの空パレコタツ発進失敗(高さ判定以上またはタスク追加フラグ不正)', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E303000', 'LOGIC', 'AGF通信異常(ハートビート途絶)', 'AGFサーバーとの通信状況および死活状況を確認してください。', 'AGFハートビートが途絶しました', NULL, 'WARN', '2024-02-28 11:18:47', '2024-02-28 11:18:47'),
	('E400001', 'LOGIC', 'DB接続異常', 'DBへの接続が出来ません', 'MySQLサーバーの状態を確認してください', NULL, 'ERROR', '2025-10-14 19:10:22', '2025-10-14 19:10:22'),
	('E400002', 'LOGIC', 'M_PLC接続異常', 'ネットワークを確認してください', 'マスターPLCとの接続が出来ませんでした。', NULL, 'ERROR', '2025-10-14 19:10:22', '2025-10-15 04:32:07'),
	('E400003', 'LOGIC', 'Aライン_カンバン工程接続異常', 'ネットワークを確認してください', 'Aライン_カンバン工程PLCとの接続が出来ませんでした。', NULL, 'ERROR', '2025-10-14 19:10:22', '2025-10-15 04:33:26'),
	('E400004', 'LOGIC', 'Bライン_カンバン工程接続異常', 'ネットワークを確認してください', 'Bライン_カンバン工程PLCとの接続が出来ませんでした。', NULL, 'ERROR', '2025-10-14 19:10:22', '2025-10-15 04:33:20'),
	('E400010', 'LOGIC', 'AMRへの搬送指示失敗', 'RMSへ完成品パレと取りの指示が失敗しました', 'AMRとRMSの状態を確認してください', NULL, 'ERROR', '2025-10-14 19:13:08', '2025-10-14 19:13:25'),
	('E400011', 'LOGIC', '設備からの搬送許可失敗', '設備からの搬送許可を確認してください', '設備からの搬送許可が出ていません', NULL, 'WARN', '2025-10-14 19:16:50', '2025-10-15 04:31:23'),
	('E400012', 'LOGIC', 'RMSパレット追加異常', 'パレットのDB設定を確認してください', 'パレットの使用設定数が足りないです。', NULL, 'WARN', '2025-10-14 22:30:41', '2025-11-13 20:24:34'),
	('E400013', 'AMR', 'AMR搬送異常', 'パレットの状態が異常です DB異常です', 'athenaのDB編集してください、t_chaos_containerのwork_statuを修正　t_robot_taskとt_jobから対象の棚搬送ジョブを消して再起動してください', NULL, 'WARN', '2025-11-06 16:36:05', '2025-11-06 16:48:10'),
	('E400014', 'LOGIC', 'パレット追加DB更新異常', 'パレットのDB設定を確認してください', '追加を失敗しました', NULL, 'WARN', '2025-10-14 22:30:41', '2025-11-13 20:24:53'),
	('E400015', 'LOGIC', 'カンバン工程AMRタスク消失異常', 'パレットをシュータへ流して、AMRのタスクをキャンセルしてください。', 'AMRのタスクが消されました。', NULL, 'WARN', '2025-10-14 22:30:41', '2025-11-24 15:01:01'),
	('E400016', 'LOGIC', 'ロボット搬送タスクが消されました。', '搬送タスクをキャンセルして、棚の状態を合わせたください', 'AMRのタスクが消されました。', NULL, 'WARN', '2025-12-05 14:04:19', '2025-12-05 14:04:26');

--  テーブル futaba_ok2_shippment.m_kotatsu の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_kotatsu` (
  `kotatsu_id` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'コタツID',
  `kotatsu_type` int NOT NULL COMMENT 'コタツ種類',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_kotatsu: ~13 rows (約) のデータをダンプしています
DELETE FROM `m_kotatsu`;
INSERT INTO `m_kotatsu` (`kotatsu_id`, `kotatsu_type`, `created_date`, `updated_date`) VALUES
	('OKE0001', 0, '2026-03-06 12:07:14', '2026-03-06 12:07:14'),
	('OKE0002', 0, '2026-03-06 12:07:29', '2026-03-06 12:07:29'),
	('OKE0003', 0, '2026-03-06 12:07:34', '2026-03-06 12:07:34'),
	('OKE0004', 0, '2026-03-06 12:07:38', '2026-03-06 12:07:38'),
	('OKE0005', 0, '2026-03-06 12:07:42', '2026-03-06 12:07:42'),
	('OKE0006', 0, '2026-03-06 12:07:45', '2026-03-06 12:07:45'),
	('OKE0007', 0, '2026-03-06 12:07:52', '2026-03-06 12:07:52'),
	('OKE0008', 0, '2026-03-06 12:07:55', '2026-03-06 12:07:55'),
	('OKE0009', 0, '2026-03-06 12:07:57', '2026-03-06 12:07:57'),
	('OKE0010', 0, '2026-03-06 12:08:01', '2026-03-06 12:08:01'),
	('OKE0011', 0, '2026-03-06 12:08:06', '2026-03-06 12:08:06'),
	('OKE0012', 0, '2026-03-19 22:01:29', '2026-03-19 22:01:29'),
	('OKE0013', 0, '2026-03-19 22:01:33', '2026-03-19 22:01:33');

--  テーブル futaba_ok2_shippment.m_lift_station の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_lift_station` (
  `plat_no` int NOT NULL COMMENT 'plat番号',
  `seq_no` int NOT NULL COMMENT 'seq番号',
  `maguchi_name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '間口１～７',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時(yyyy/MM/dd hh:mm:ss)',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時(yyyy/MM/dd hh:mm:ss)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_lift_station: ~6 rows (約) のデータをダンプしています
DELETE FROM `m_lift_station`;
INSERT INTO `m_lift_station` (`plat_no`, `seq_no`, `maguchi_name`, `created_date`, `updated_date`) VALUES
	(80, 0, '間口1(80,0)', '2026-03-10 17:26:35', '2026-03-31 20:41:25'),
	(80, 1, '間口2(80,1)', '2026-03-10 17:26:57', '2026-03-31 20:41:32'),
	(80, 2, '間口3(80,2)', '2026-03-10 17:29:03', '2026-03-31 20:41:39'),
	(81, 0, '間口4(81,0)', '2026-03-10 17:29:23', '2026-03-31 20:41:49'),
	(81, 1, '間口5(81,1)', '2026-03-10 17:30:01', '2026-03-31 20:41:57'),
	(81, 2, '間口6(81,2)', '2026-03-10 17:30:21', '2026-03-31 20:42:06');

--  テーブル futaba_ok2_shippment.m_line の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_line` (
  `line_id` int NOT NULL COMMENT 'ラインID',
  `line_name` varchar(18) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'ライン名',
  `line_description` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT 'ライン説明',
  `carry_pattern` int NOT NULL DEFAULT '1' COMMENT '搬送パターン',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_line: ~4 rows (約) のデータをダンプしています
DELETE FROM `m_line`;
INSERT INTO `m_line` (`line_id`, `line_name`, `line_description`, `carry_pattern`, `created_date`, `updated_date`) VALUES
	(1, 'T63', '', 1, '2026-02-27 15:19:38', '2026-04-06 20:17:47'),
	(2, 'T64', '', 2, '2026-02-27 15:19:48', '2026-04-09 03:15:33'),
	(3, 'T65', '', 2, '2026-02-27 15:20:01', '2026-04-06 23:00:45'),
	(4, 'T66', '', 2, '2026-02-27 15:20:08', '2026-04-06 20:17:54');

--  テーブル futaba_ok2_shippment.m_location の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_location` (
  `cell_code` int NOT NULL COMMENT 'セルコード',
  `cell_type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'セルタイプ',
  `cell_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'セル名称',
  `cell_description` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'セル説明',
  `plat_no` int NOT NULL COMMENT 'plat番号',
  `seq_no` int NOT NULL COMMENT 'seq番号',
  `angle` int NOT NULL DEFAULT (0),
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_location: ~18 rows (約) のデータをダンプしています
DELETE FROM `m_location`;
INSERT INTO `m_location` (`cell_code`, `cell_type`, `cell_name`, `cell_description`, `plat_no`, `seq_no`, `angle`, `created_date`, `updated_date`) VALUES
	(25001000, 'input', 'T66ライン 完成品投入間口', NULL, 60, 0, 90, '2026-03-06 11:26:00', '2026-03-31 00:44:14'),
	(27001000, 'wait', 'T66ライン 次使用パレット置き場', NULL, 60, 1, 90, '2026-03-06 11:26:00', '2026-03-31 00:51:06'),
	(23051000, 'temp', 'T66ライン 完成品一時置き場', NULL, 60, 2, 90, '2026-03-06 11:26:00', '2026-03-31 00:44:09'),
	(27072660, 'wait', 'T65ライン 完成品投入間口', NULL, 61, 0, -90, '2026-03-06 11:26:00', '2026-03-31 00:43:28'),
	(25072660, 'input', 'T65ライン 次使用パレット置き場', NULL, 61, 1, -90, '2026-03-06 11:26:00', '2026-03-31 00:43:33'),
	(23102660, 'temp', 'T65ライン 完成品一時置き場', NULL, 61, 2, -90, '2026-03-06 11:26:00', '2026-03-31 00:43:59'),
	(27643720, 'input', 'T64ライン 完成品投入間口', NULL, 62, 0, -90, '2026-03-06 11:26:00', '2026-03-20 00:57:56'),
	(25743720, 'wait', 'T64ライン 次使用パレット置き場', NULL, 62, 1, -90, '2026-03-06 11:26:00', '2026-03-20 00:57:58'),
	(27643848, 'temp', 'T64ライン 完成品一時置き場', NULL, 62, 2, -90, '2026-03-06 11:26:00', '2026-03-20 00:57:59'),
	(27644368, 'input', 'T63ライン 完成品投入間口', NULL, 63, 0, 90, '2026-03-06 11:26:00', '2026-03-20 00:58:00'),
	(25744368, 'wait', 'T63ライン 次使用パレット置き場', NULL, 63, 1, 90, '2026-03-06 11:26:00', '2026-03-20 00:58:01'),
	(27644240, 'temp', 'T63ライン 完成品一時置き場', NULL, 63, 2, 90, '2026-03-06 11:26:00', '2026-03-20 00:58:03'),
	(21233530, 'complete', 'T63,64 完成品引き取り間口', NULL, 81, 0, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:43'),
	(21233330, 'complete', 'T63,64 完成品引き取り間口', NULL, 81, 1, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:46'),
	(21233130, 'complete', 'T63,64 完成品引き取り間口', NULL, 81, 2, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:47'),
	(21232430, 'complete', 'T65,66 完成品引き取り間口', NULL, 80, 0, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:47'),
	(21232230, 'complete', 'T65,66 完成品引き取り間口', NULL, 80, 1, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:48'),
	(21232030, 'complete', 'T65,66 完成品引き取り間口', NULL, 80, 2, 0, '2026-03-06 11:26:00', '2026-03-09 18:00:48');

--  テーブル futaba_ok2_shippment.m_pallet の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_pallet` (
  `pallet_type` int NOT NULL COMMENT 'パレット種類',
  `pallet_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'パレット名称',
  `versatility` tinyint(1) NOT NULL DEFAULT '0' COMMENT '汎用性(0=専用, 1=汎用)',
  `line_id` int NOT NULL,
  `kotatsu_type` int NOT NULL DEFAULT '0' COMMENT 'コタツ種類',
  `kanban_angle` int NOT NULL DEFAULT '0' COMMENT 'カンバンの向き',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_pallet: ~16 rows (約) のデータをダンプしています
DELETE FROM `m_pallet`;
INSERT INTO `m_pallet` (`pallet_type`, `pallet_name`, `versatility`, `line_id`, `kotatsu_type`, `kanban_angle`, `created_date`, `updated_date`) VALUES
	(1, 'RH 300インナー(T65)', 0, 3, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:32'),
	(2, 'RH 300/440インナー(T65)', 0, 3, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:33'),
	(3, 'RH 155インナー(T65)', 0, 3, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:33'),
	(4, 'RH 557インナー(T65)', 0, 3, 1, 180, '2026-03-06 11:55:00', '2026-03-26 22:30:24'),
	(11, 'LH 300インナー(T66)', 0, 4, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:23'),
	(12, 'LH 300/440インナー(T66)', 0, 4, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:22'),
	(13, 'LH 155インナー(T66)', 0, 4, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:22'),
	(14, 'LH 557インナー(T66)', 0, 4, 1, 180, '2026-03-06 11:55:00', '2026-03-26 22:30:21'),
	(21, 'RH 300アウター(T63)', 0, 1, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:19'),
	(22, 'RH 300/440アウター(T63)', 0, 1, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:12'),
	(23, 'RH 155アウター(T63)', 0, 1, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:12'),
	(24, 'RH 557アウター(T63)', 0, 1, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:12'),
	(31, 'LH 300アウター(T64)', 0, 2, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:13'),
	(32, 'LH 300/440アウター(T64)', 0, 2, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:14'),
	(33, 'LH 155アウター(T64)', 0, 2, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:15'),
	(34, 'LH 557アウター(T64)', 0, 2, 1, 0, '2026-03-06 11:55:00', '2026-03-26 22:30:16');

--  テーブル futaba_ok2_shippment.m_product の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_product` (
  `product_no` int NOT NULL COMMENT '製品番号',
  `product_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '製品名称',
  `pallet_type` int NOT NULL COMMENT '使用パレット種類',
  `capacity` int NOT NULL COMMENT '収内数',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_product: ~0 rows (約) のデータをダンプしています
DELETE FROM `m_product`;

--  テーブル futaba_ok2_shippment.m_robot の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_robot` (
  `robot_id` int NOT NULL DEFAULT (0) COMMENT 'ロボットID',
  `robot_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ロボット名称',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_robot: ~3 rows (約) のデータをダンプしています
DELETE FROM `m_robot`;
INSERT INTO `m_robot` (`robot_id`, `robot_name`, `created_date`, `updated_date`) VALUES
	(9990003, 'VM-3', '2026-03-06 12:01:19', '2026-03-06 12:01:59'),
	(9990002, 'VM-2', '2026-03-06 12:01:29', '2026-03-06 12:02:03'),
	(9990001, 'VM-1', '2026-03-06 12:01:44', '2026-03-06 12:02:09');

--  テーブル futaba_ok2_shippment.m_signal_list の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_signal_list` (
  `signal_id` int NOT NULL COMMENT '信号ID',
  `plat_no` int NOT NULL COMMENT 'plat番号',
  `seq_no` int NOT NULL COMMENT 'seq番号',
  `signal_class` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '入出力設定',
  `signal_type` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '信号種類',
  `value` int NOT NULL DEFAULT '0' COMMENT '値',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '変更時間(yyyy/MM/dd hh:mm:ss)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時(yyyy/MM/dd hh:mm:ss)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_signal_list: ~8 rows (約) のデータをダンプしています
DELETE FROM `m_signal_list`;
INSERT INTO `m_signal_list` (`signal_id`, `plat_no`, `seq_no`, `signal_class`, `signal_type`, `value`, `updated_date`, `created_date`) VALUES
	(1300, 63, 0, 'input', 'START', 0, '2026-04-10 19:11:09', '2026-04-10 18:47:38'),
	(1400, 62, 0, 'input', 'START', 0, '2026-04-10 19:11:10', '2026-04-10 18:48:02'),
	(1600, 61, 0, 'input', 'START', 0, '2026-04-10 19:11:10', '2026-04-10 18:48:54'),
	(1800, 60, 0, 'input', 'START', 0, '2026-04-10 19:11:12', '2026-04-10 18:49:10'),
	(1300, 63, 0, 'output', 'ACCEPTED', 0, '2026-04-10 19:12:09', '2026-04-10 18:49:46'),
	(1400, 62, 0, 'output', 'ACCEPTED', 0, '2026-04-10 19:12:10', '2026-04-10 18:50:36'),
	(1600, 61, 0, 'output', 'ACCEPTED', 0, '2026-04-10 19:12:10', '2026-04-10 18:50:51'),
	(1800, 60, 0, 'output', 'ACCEPTED', 0, '2026-04-10 19:12:15', '2026-04-10 18:51:03');

--  テーブル futaba_ok2_shippment.m_station の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_station` (
  `id` int NOT NULL COMMENT 'ラインID',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '""' COMMENT '間口パレット',
  `cell_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '""' COMMENT 'セルタイプ',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時(yyyy/MM/dd hh:mm:ss)',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '変更日時(yyyy/MM/dd hh:mm:ss)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_station: ~4 rows (約) のデータをダンプしています
DELETE FROM `m_station`;
INSERT INTO `m_station` (`id`, `name`, `cell_type`, `created_date`, `updated_date`) VALUES
	(1, '間口１パレット', 'input', '2026-03-17 20:15:11', '2026-03-17 20:31:53'),
	(2, '間口２パレット', 'wait', '2026-03-17 20:16:47', '2026-03-17 20:31:19'),
	(3, '間口３パレット', 'temp', '2026-03-17 20:17:13', '2026-03-17 20:32:10'),
	(4, '間口４パレット', 'comp', '2026-03-17 20:17:25', '2026-03-17 20:32:20');

--  テーブル futaba_ok2_shippment.m_system_interlock の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_system_interlock` (
  `system_id` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'システムID',
  `line_id` int NOT NULL DEFAULT (0) COMMENT 'ラインID',
  `transport_permission` tinyint(1) NOT NULL COMMENT '搬送許可(1 = 許可, 0 = 禁止)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_system_interlock: ~4 rows (約) のデータをダンプしています
DELETE FROM `m_system_interlock`;
INSERT INTO `m_system_interlock` (`system_id`, `line_id`, `transport_permission`, `created_date`, `updated_date`) VALUES
	('1', 1, 1, '2026-02-27 15:21:04', '2026-04-03 02:35:08'),
	('1', 2, 1, '2026-02-27 15:21:30', '2026-04-13 19:56:39'),
	('1', 3, 1, '2026-02-27 15:21:40', '2026-04-13 19:56:41'),
	('1', 4, 1, '2026-02-27 15:21:51', '2026-04-13 19:56:45');

--  テーブル futaba_ok2_shippment.m_system_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `m_system_status` (
  `system_id` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'システムID',
  `system_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'システム名称',
  `mode` tinyint(1) NOT NULL COMMENT 'モード(1 = 自動, 0 = 各個)',
  `preparation_ok` tinyint(1) NOT NULL COMMENT '運転準備(1 = 完了, 0 = 未完)',
  `auto_running` tinyint(1) NOT NULL COMMENT '自動運転(1 = 運転中, 0 = 停止中)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.m_system_status: ~1 rows (約) のデータをダンプしています
DELETE FROM `m_system_status`;
INSERT INTO `m_system_status` (`system_id`, `system_name`, `mode`, `preparation_ok`, `auto_running`, `created_date`, `updated_date`) VALUES
	('1', '岡崎工場　2号棟　完成品パレット搬送', 1, 1, 1, '2026-03-06 12:03:53', '2026-04-13 20:41:35');

--  テーブル futaba_ok2_shippment.t_callback_task_events の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_callback_task_events` (
  `task_id` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'タスクID',
  `request_id` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Request ID',
  `event_json` json NOT NULL COMMENT '受信したフルJSON',
  `created_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時',
  PRIMARY KEY (`task_id`,`request_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_callback_task_events: ~148 rows (約) のデータをダンプしています
DELETE FROM `t_callback_task_events`;
INSERT INTO `t_callback_task_events` (`task_id`, `request_id`, `event_json`, `created_date`, `updated_date`) VALUES
	('3347443', 'f058e0bd-287f-40b4-9fd7-c38baa27eb0b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3347443, "robotId": 3455052, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "f058e0bd-287f-40b4-9fd7-c38baa27eb0b", "warehouseCode": "geekplus"}}}', '2026-04-11 00:49:16', '2026-04-11 00:49:16'),
	('3361149', 'fc6cd6dd-ebbf-4819-8fba-65568eb3edb2', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361149, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "fc6cd6dd-ebbf-4819-8fba-65568eb3edb2", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:06', '2026-04-13 00:07:06'),
	('3361150', 'acb02a25-e4a0-421e-9f13-249d85174bd4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361150, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "acb02a25-e4a0-421e-9f13-249d85174bd4", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:03', '2026-04-13 00:07:03'),
	('3361152', '8e50af96-6421-424b-8415-0101a401747b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361152, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "8e50af96-6421-424b-8415-0101a401747b", "warehouseCode": "geekplus"}}}', '2026-04-13 00:06:50', '2026-04-13 00:06:50'),
	('3361153', 'a0e1ada3-9abd-44ba-a644-c9748abf8405', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361153, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a0e1ada3-9abd-44ba-a644-c9748abf8405", "warehouseCode": "geekplus"}}}', '2026-04-13 00:06:58', '2026-04-13 00:06:58'),
	('3361154', 'bd271121-c97b-4fc9-b05b-86628b0447d9', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361154, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "bd271121-c97b-4fc9-b05b-86628b0447d9", "warehouseCode": "geekplus"}}}', '2026-04-13 00:06:54', '2026-04-13 00:06:54'),
	('3361155', 'fd2bd13c-067e-4e6b-abd6-990344f29a9b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361155, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "fd2bd13c-067e-4e6b-abd6-990344f29a9b", "warehouseCode": "geekplus"}}}', '2026-04-13 00:06:52', '2026-04-13 00:06:52'),
	('3361156', '40e317a1-ea7d-4390-98c7-5794835803d8', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361156, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "40e317a1-ea7d-4390-98c7-5794835803d8", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:09', '2026-04-13 00:07:09'),
	('3361157', '83b67dcd-f6da-45fc-a71e-3857a149aa40', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361157, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "83b67dcd-f6da-45fc-a71e-3857a149aa40", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:10', '2026-04-13 00:07:10'),
	('3361158', '720da8c9-85ad-4d71-88d4-7341bfdcf808', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361158, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "720da8c9-85ad-4d71-88d4-7341bfdcf808", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:21', '2026-04-13 00:07:21'),
	('3361159', '2e17751b-9388-4270-901b-d66e6c961909', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361159, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "2e17751b-9388-4270-901b-d66e6c961909", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:17', '2026-04-13 00:07:17'),
	('3361160', '31aa29ba-7bb3-452b-8364-8243ec352079', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361160, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "31aa29ba-7bb3-452b-8364-8243ec352079", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:11', '2026-04-13 00:07:11'),
	('3361161', '41158000-0d4e-4dca-94b4-e9f26e972378', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3361161, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "CANCELED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "41158000-0d4e-4dca-94b4-e9f26e972378", "warehouseCode": "geekplus"}}}', '2026-04-13 00:07:13', '2026-04-13 00:07:13'),
	('3364340', 'f496ef4d-ac9f-4087-85e1-a9db128777a2', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364340, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "f496ef4d-ac9f-4087-85e1-a9db128777a2", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364342', 'c7035d47-8a15-4854-896d-c26d0d041476', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364342, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c7035d47-8a15-4854-896d-c26d0d041476", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364343', 'b0e4b6d5-99f2-4c10-8509-ddc23234746e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364343, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b0e4b6d5-99f2-4c10-8509-ddc23234746e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364350', '6c237739-d2f5-45fe-b520-b44dd848804a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364350, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6c237739-d2f5-45fe-b520-b44dd848804a", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:07', '2026-04-13 01:42:07'),
	('3364352', '58b2f5a8-4a76-4017-97b9-b28ad1e40a36', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364352, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "58b2f5a8-4a76-4017-97b9-b28ad1e40a36", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364353', '3c8782c0-2f54-4ccb-8317-a3d8b7a506ef', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364353, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3c8782c0-2f54-4ccb-8317-a3d8b7a506ef", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364354', '401301b4-df1e-454e-9ef6-54c409416af6', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364354, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "401301b4-df1e-454e-9ef6-54c409416af6", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364355', 'bf59142a-9eed-4aca-9469-7a47dd36e6ac', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364355, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "bf59142a-9eed-4aca-9469-7a47dd36e6ac", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364356', 'c0c50fc6-cf6d-4a08-80f7-2571497a6882', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364356, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c0c50fc6-cf6d-4a08-80f7-2571497a6882", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364357', '1ad67724-bfaf-472e-8c92-ce0989c7b7dc', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364357, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "1ad67724-bfaf-472e-8c92-ce0989c7b7dc", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364358', '94fcef39-bcb7-4604-b989-174dcc622689', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364358, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "94fcef39-bcb7-4604-b989-174dcc622689", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364359', '35d6391d-ba6d-4b23-8010-07fba8492959', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364359, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "35d6391d-ba6d-4b23-8010-07fba8492959", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364360', '0af68fe1-ce7c-4255-b805-4a29a81b3077', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364360, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0af68fe1-ce7c-4255-b805-4a29a81b3077", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364361', 'c88fdc9d-cfc1-4bf3-bfdf-82e02598dae4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364361, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c88fdc9d-cfc1-4bf3-bfdf-82e02598dae4", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364362', '0bc4f558-c8e8-49fa-be2e-cd7ec5ae7444', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364362, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0bc4f558-c8e8-49fa-be2e-cd7ec5ae7444", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364363', '4af0357c-79ec-4319-af0a-936c5e180ee4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364363, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "4af0357c-79ec-4319-af0a-936c5e180ee4", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364365', 'c0c10503-660f-49cd-8297-201966d164c9', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364365, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c0c10503-660f-49cd-8297-201966d164c9", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364366', 'd2e4457e-7583-49be-ab01-de3dd411888d', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364366, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "d2e4457e-7583-49be-ab01-de3dd411888d", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364367', '61163dac-bfdd-42d3-9aeb-39230bc02a02', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364367, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "61163dac-bfdd-42d3-9aeb-39230bc02a02", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364368', '98c5d2a4-1908-4921-b8fe-4c5f322321a7', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364368, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "98c5d2a4-1908-4921-b8fe-4c5f322321a7", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364369', 'd4104937-8a28-4bad-a72b-06dea3b48799', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364369, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "d4104937-8a28-4bad-a72b-06dea3b48799", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364370', 'e74eb48a-5cef-47e8-97cd-822d4369f6ae', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364370, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e74eb48a-5cef-47e8-97cd-822d4369f6ae", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364371', '3f0898fa-d1f4-470f-9c22-bd596273c31e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364371, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3f0898fa-d1f4-470f-9c22-bd596273c31e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364372', 'dc8dec63-5523-4b31-bf71-b111142d31e9', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364372, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "dc8dec63-5523-4b31-bf71-b111142d31e9", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364373', '57cd3feb-b991-4982-a7bb-115d13ebb9af', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364373, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "57cd3feb-b991-4982-a7bb-115d13ebb9af", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364374', '133f2fc8-c404-4ad8-9394-026d787ff9d7', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364374, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "133f2fc8-c404-4ad8-9394-026d787ff9d7", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364375', 'fd4037cd-14a6-4dcc-b08f-5c5edf2b97f8', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364375, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "fd4037cd-14a6-4dcc-b08f-5c5edf2b97f8", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364376', '663e9fd5-fc80-4d53-85a3-1f24fc0721d7', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364376, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "663e9fd5-fc80-4d53-85a3-1f24fc0721d7", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364378', 'f9e2a5e3-d268-4cc7-85b2-bee9d73dd6e1', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364378, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "f9e2a5e3-d268-4cc7-85b2-bee9d73dd6e1", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364379', 'e8d821a2-2d60-41b1-bfec-dc0f88d77fe0', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364379, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e8d821a2-2d60-41b1-bfec-dc0f88d77fe0", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364380', '81044571-2ce4-4a6f-a956-ef106bbe3810', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364380, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "81044571-2ce4-4a6f-a956-ef106bbe3810", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364381', '09349d62-1be8-4843-80a4-bf07a9542d21', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364381, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "09349d62-1be8-4843-80a4-bf07a9542d21", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364382', '4854a146-35d8-46b2-b9bf-540ba7a4a01a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364382, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "4854a146-35d8-46b2-b9bf-540ba7a4a01a", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364383', '9c7a0b10-595b-447d-8b43-aaa35aa30b0d', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364383, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "9c7a0b10-595b-447d-8b43-aaa35aa30b0d", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364384', 'cf1729f0-06f4-4118-9656-a34cf3fede24', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364384, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "cf1729f0-06f4-4118-9656-a34cf3fede24", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364385', '4c79ef78-80dd-4a83-a2f1-a8fe97b26159', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364385, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "4c79ef78-80dd-4a83-a2f1-a8fe97b26159", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364386', '88425b1a-6e09-4769-b6b7-9e52df1a9d78', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364386, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "88425b1a-6e09-4769-b6b7-9e52df1a9d78", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364387', '6f654c54-828d-415b-9353-88211770775b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364387, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6f654c54-828d-415b-9353-88211770775b", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364390', 'b3815610-4585-4499-8a01-ab7fbf15b01f', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364390, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b3815610-4585-4499-8a01-ab7fbf15b01f", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364391', '0224b6d9-067e-4825-95f8-e26f0ec148a8', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364391, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0224b6d9-067e-4825-95f8-e26f0ec148a8", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364392', 'b8624196-e07e-4bd7-9ceb-9adf722dd681', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364392, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b8624196-e07e-4bd7-9ceb-9adf722dd681", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364393', 'af1291dc-b457-4ead-a546-67f6f01f158b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364393, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "af1291dc-b457-4ead-a546-67f6f01f158b", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364394', '409d5f23-4444-4b4c-8298-b17ab80ef2da', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364394, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "409d5f23-4444-4b4c-8298-b17ab80ef2da", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364395', '7a3c618d-2c93-48db-8f26-1b474a0ac41f', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364395, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7a3c618d-2c93-48db-8f26-1b474a0ac41f", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364396', '7056f4e2-35b8-4043-9e33-1d57face46fa', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364396, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7056f4e2-35b8-4043-9e33-1d57face46fa", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364397', 'f042136e-814f-4826-9385-1c2a8ce2cfb3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364397, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "f042136e-814f-4826-9385-1c2a8ce2cfb3", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364398', '8f2afab9-dbc2-4ea3-bd0c-1338272fa592', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364398, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "8f2afab9-dbc2-4ea3-bd0c-1338272fa592", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364399', 'f01842ac-41a7-493d-b0ee-bef838696a17', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364399, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "f01842ac-41a7-493d-b0ee-bef838696a17", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364400', 'd9d2e76e-d00b-4717-bf15-a0b7aaa8f13e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364400, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "d9d2e76e-d00b-4717-bf15-a0b7aaa8f13e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364401', '21c58a68-d266-4d37-b205-0460ebda99c0', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364401, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "21c58a68-d266-4d37-b205-0460ebda99c0", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364402', 'afc28c06-8b3a-4af2-994d-c9bef2337eac', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364402, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "afc28c06-8b3a-4af2-994d-c9bef2337eac", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364403', 'df6ff56e-cae6-42a6-91a6-263c7bb8e5b5', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364403, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "df6ff56e-cae6-42a6-91a6-263c7bb8e5b5", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364405', '53171416-a4ff-4da7-a07f-39a1ce03d436', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364405, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "53171416-a4ff-4da7-a07f-39a1ce03d436", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364406', 'cc26ceed-c0d4-4f95-b37d-503d841b5c32', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364406, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "cc26ceed-c0d4-4f95-b37d-503d841b5c32", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364407', 'dfe8e2f4-9776-4f99-8456-2f4f7f069360', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364407, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "dfe8e2f4-9776-4f99-8456-2f4f7f069360", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364408', 'c5716e45-413a-4da9-b3d2-65da3f559aaa', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364408, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c5716e45-413a-4da9-b3d2-65da3f559aaa", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364409', '2ac345a5-9a68-4cf9-a48c-64be1d61ebcd', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364409, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "2ac345a5-9a68-4cf9-a48c-64be1d61ebcd", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364410', 'cfd762ea-2e1d-4251-ab4c-e2a455da0196', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364410, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "cfd762ea-2e1d-4251-ab4c-e2a455da0196", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364412', '580caafd-d2a4-4843-a051-5aa3e582dbe1', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364412, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "580caafd-d2a4-4843-a051-5aa3e582dbe1", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364413', 'be7e6029-cf79-4f69-b15c-c091cb695e3b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364413, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "be7e6029-cf79-4f69-b15c-c091cb695e3b", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364414', '41d2fc04-9847-4743-be80-99762d704a78', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364414, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "41d2fc04-9847-4743-be80-99762d704a78", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364415', '58d2aa1d-8996-45e1-90ce-8183750056f9', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364415, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "58d2aa1d-8996-45e1-90ce-8183750056f9", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364416', '83168c04-60fc-4bb5-9118-bc6495f1be2b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364416, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "83168c04-60fc-4bb5-9118-bc6495f1be2b", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364417', '02a5cd1c-7e4e-421d-8d9c-18bf3d55b584', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364417, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "02a5cd1c-7e4e-421d-8d9c-18bf3d55b584", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364418', 'e7d1e689-2581-4b35-99bb-a4d0da7c3440', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364418, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e7d1e689-2581-4b35-99bb-a4d0da7c3440", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364419', '88a9ab03-3b7e-401f-bfd5-a1c188f67c1c', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364419, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "88a9ab03-3b7e-401f-bfd5-a1c188f67c1c", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364420', '5d09c705-0098-418b-85a8-9bdcdc594ed1', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364420, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "5d09c705-0098-418b-85a8-9bdcdc594ed1", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364421', '2a6bf3ef-f2e2-425a-8149-bc720c58ed2c', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364421, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "2a6bf3ef-f2e2-425a-8149-bc720c58ed2c", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364429', 'b3c3394c-4ba9-4760-9792-f2adf063199e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364429, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b3c3394c-4ba9-4760-9792-f2adf063199e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364433', 'e58a6a3d-20e0-4444-a601-64f5d12be638', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364433, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e58a6a3d-20e0-4444-a601-64f5d12be638", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364434', '3202775c-1185-4b9f-8311-c421faf9c31e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364434, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3202775c-1185-4b9f-8311-c421faf9c31e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364438', '7e022db6-0e33-4282-ba6f-e9e538eae600', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364438, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7e022db6-0e33-4282-ba6f-e9e538eae600", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:27', '2026-04-13 01:42:27'),
	('3364440', '0f620c9c-d249-4a4a-b311-bfc9aee63b3e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364440, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0f620c9c-d249-4a4a-b311-bfc9aee63b3e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364441', '68f0cbda-24cc-4028-8bd4-13676dd5d263', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364441, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "68f0cbda-24cc-4028-8bd4-13676dd5d263", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364442', '763cc39b-00bd-4959-b676-1bdfa6660b4e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364442, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "763cc39b-00bd-4959-b676-1bdfa6660b4e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364444', 'b45f71f7-04ec-498a-811f-1fcc45ab74bb', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364444, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b45f71f7-04ec-498a-811f-1fcc45ab74bb", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364448', 'c0c62bae-aaea-42ab-bcff-8813a68fbb06', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364448, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c0c62bae-aaea-42ab-bcff-8813a68fbb06", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364449', 'ff3e7e74-8012-4b43-9fe8-cf673b54d95d', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364449, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "ff3e7e74-8012-4b43-9fe8-cf673b54d95d", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364450', '7ea8b989-07e1-4245-88af-1d028d6a2067', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364450, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7ea8b989-07e1-4245-88af-1d028d6a2067", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364451', '68d75a11-4dd7-4ccc-86fc-91120867c797', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364451, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "68d75a11-4dd7-4ccc-86fc-91120867c797", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364452', '78e068ad-cb8b-405c-8204-2245e10fe88a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364452, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "78e068ad-cb8b-405c-8204-2245e10fe88a", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364454', 'a945bbc9-c6db-435c-b298-dcb1f188c150', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364454, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a945bbc9-c6db-435c-b298-dcb1f188c150", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364455', '037da359-8cb7-4a9b-82fe-a1224766b27d', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364455, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "037da359-8cb7-4a9b-82fe-a1224766b27d", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364464', 'a2dd4137-b091-4d2a-8089-ee1a2a372670', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364464, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a2dd4137-b091-4d2a-8089-ee1a2a372670", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364465', '5bc4de06-07ac-469e-aaf6-66bb494e9b1a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364465, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "5bc4de06-07ac-469e-aaf6-66bb494e9b1a", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364466', '9d2a116e-d6ce-44be-b5ab-66aaf431c313', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364466, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "9d2a116e-d6ce-44be-b5ab-66aaf431c313", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364467', '7cf3cdd3-4821-4660-a703-567f5de2df2f', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364467, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7cf3cdd3-4821-4660-a703-567f5de2df2f", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:06', '2026-04-13 01:42:06'),
	('3364468', '8a2f119f-3c15-4caa-bba2-93e378b94f04', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364468, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "8a2f119f-3c15-4caa-bba2-93e378b94f04", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364469', '086884be-8470-483b-9ee4-c2f759fd0836', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364469, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "086884be-8470-483b-9ee4-c2f759fd0836", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364470', 'ba353a63-9f4a-4c87-bed0-55db68fa31a3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364470, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "ba353a63-9f4a-4c87-bed0-55db68fa31a3", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364471', 'b3a84254-505a-4c74-8988-69a0e6801e16', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364471, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b3a84254-505a-4c74-8988-69a0e6801e16", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364472', '0f8fa1eb-b3dc-48e8-b0e4-32077266bb3c', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364472, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0f8fa1eb-b3dc-48e8-b0e4-32077266bb3c", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364473', 'd1e54999-7bd3-46a6-9162-a719285ca5d7', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364473, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "d1e54999-7bd3-46a6-9162-a719285ca5d7", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364474', 'e54f6e1e-54c2-4a03-ab5e-a8f5c1546323', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364474, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e54f6e1e-54c2-4a03-ab5e-a8f5c1546323", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364475', '7e43ccdd-5149-47e7-900e-08558415f2fa', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364475, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "7e43ccdd-5149-47e7-900e-08558415f2fa", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364476', '5df5d6f3-b27b-498b-a534-0b526abb5b74', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364476, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "5df5d6f3-b27b-498b-a534-0b526abb5b74", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364477', '2f18c569-f364-4718-8873-0e09eb10d070', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364477, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "2f18c569-f364-4718-8873-0e09eb10d070", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364478', '0629cba0-f73c-4fb5-aaae-423f7bd49520', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364478, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "0629cba0-f73c-4fb5-aaae-423f7bd49520", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364479', '11d88781-bcdc-4e17-8717-2928d7b10fc4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364479, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "11d88781-bcdc-4e17-8717-2928d7b10fc4", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364480', '6c02e13f-8fda-4629-bf9d-7a3918cf4097', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364480, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6c02e13f-8fda-4629-bf9d-7a3918cf4097", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364486', '49e5c1d0-29bd-4246-9fb7-7473c07c9994', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364486, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "49e5c1d0-29bd-4246-9fb7-7473c07c9994", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364495', '6f81e355-6687-4406-b650-51e64af41c32', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364495, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6f81e355-6687-4406-b650-51e64af41c32", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364496', '5212085b-7d62-486c-b544-b609c605db78', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364496, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "5212085b-7d62-486c-b544-b609c605db78", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364497', '72bc0b7b-4f5d-415d-92ce-46480d788d83', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364497, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "72bc0b7b-4f5d-415d-92ce-46480d788d83", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364502', 'b7b95bad-a233-495f-ad1c-5f8c2c4b2992', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364502, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b7b95bad-a233-495f-ad1c-5f8c2c4b2992", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364506', '4a071d15-81f1-48d9-8dc3-41c974d5e597', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364506, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "4a071d15-81f1-48d9-8dc3-41c974d5e597", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364508', '981c6894-63be-44a4-b393-ddbee1c13069', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364508, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "981c6894-63be-44a4-b393-ddbee1c13069", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364510', '88e5bef0-618d-49eb-a3ec-982cbcb53fa9', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364510, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "88e5bef0-618d-49eb-a3ec-982cbcb53fa9", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364512', '3235a972-b936-496d-81a1-a12792627bc3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364512, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3235a972-b936-496d-81a1-a12792627bc3", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364514', '8f86983e-147e-4f1e-9fce-2b9eb91b2531', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364514, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "8f86983e-147e-4f1e-9fce-2b9eb91b2531", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364515', '6e354453-7d6d-47ec-b7bd-a479c4f3d295', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364515, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6e354453-7d6d-47ec-b7bd-a479c4f3d295", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364516', '251c9d6f-f940-4838-b7b1-8ec47345d488', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364516, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "251c9d6f-f940-4838-b7b1-8ec47345d488", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364517', '749ce973-0041-4c53-ac8c-9648a43be443', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364517, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "749ce973-0041-4c53-ac8c-9648a43be443", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364518', '01147aac-d46e-4eb0-b7fe-d718d481ad58', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364518, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "01147aac-d46e-4eb0-b7fe-d718d481ad58", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364522', 'c6024e65-8845-4fa5-a08b-cd7f321635ba', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364522, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c6024e65-8845-4fa5-a08b-cd7f321635ba", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364524', '54165279-d552-4bde-936c-7fcd60dc58ef', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364524, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "54165279-d552-4bde-936c-7fcd60dc58ef", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364526', '61ba1333-d62a-4612-9041-7befffd4ab93', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364526, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "61ba1333-d62a-4612-9041-7befffd4ab93", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364528', '444eac88-24bc-4f2e-aabc-e432e449f82d', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364528, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "444eac88-24bc-4f2e-aabc-e432e449f82d", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364529', '6401fb8b-c724-445f-8d8e-d4d09f850b87', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364529, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6401fb8b-c724-445f-8d8e-d4d09f850b87", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364530', '97759633-e61b-459d-ac5b-c9d8c882d700', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364530, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "97759633-e61b-459d-ac5b-c9d8c882d700", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364531', '593b4aae-e3a0-4429-a5db-f97f08ed7c6e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364531, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "593b4aae-e3a0-4429-a5db-f97f08ed7c6e", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364532', 'd2cce5fe-b66d-47aa-b058-9a1eabd0ccd4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364532, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "d2cce5fe-b66d-47aa-b058-9a1eabd0ccd4", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364533', 'e5dd768c-cc54-4f9b-827a-43d4ec3fb631', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364533, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "e5dd768c-cc54-4f9b-827a-43d4ec3fb631", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364534', 'a4cf1dba-c735-46f6-ad03-dd38acff63a5', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364534, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a4cf1dba-c735-46f6-ad03-dd38acff63a5", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364535', 'c70b885e-6bab-43cf-bbed-bd433aae14e0', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364535, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "c70b885e-6bab-43cf-bbed-bd433aae14e0", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364536', 'a2c8d159-2549-431a-aca5-110d21f83057', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364536, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a2c8d159-2549-431a-aca5-110d21f83057", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364538', 'b825a584-f5e1-4e41-bbad-51166507f529', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364538, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b825a584-f5e1-4e41-bbad-51166507f529", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364539', 'fa565310-3dd3-44c3-9915-80cf3803913b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364539, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "fa565310-3dd3-44c3-9915-80cf3803913b", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364546', '3e04c6af-39cb-4bae-845f-3a609ccd7032', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364546, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3e04c6af-39cb-4bae-845f-3a609ccd7032", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364547', 'b753becd-5f70-49b4-bc8d-3fdc7df97fd3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364547, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "b753becd-5f70-49b4-bc8d-3fdc7df97fd3", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364550', '5b1976df-087d-4d7b-aa0f-555a6d2683a7', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364550, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "5b1976df-087d-4d7b-aa0f-555a6d2683a7", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364551', '6e57ae9a-1240-476f-9494-459204fbaa28', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364551, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "6e57ae9a-1240-476f-9494-459204fbaa28", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364554', '3d3b9f99-6af9-4f2d-b0f6-6788a7d47ed3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364554, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "3d3b9f99-6af9-4f2d-b0f6-6788a7d47ed3", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364556', '99e9dc3b-a37c-4b8d-805c-0047321c65e8', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364556, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "99e9dc3b-a37c-4b8d-805c-0047321c65e8", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364560', 'a7adb499-4136-4dda-a645-4a7bdcdd48f6', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3364560, "robotId": 3455050, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0003", "taskStatus": "COMPLETED", "instruction": "GO_RETURN"}, "header": {"version": "3.3.0", "requestId": "a7adb499-4136-4dda-a645-4a7bdcdd48f6", "warehouseCode": "geekplus"}}}', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3366978', '3c1b1722-369d-41f9-8232-cb0bde86dd12', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366978, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "taskPhase": "SHELF_FETCHED", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602830", "destHostCode": "22602830", "destLocation": {"x": 22.6, "y": 28.39, "z": 1}}, "header": {"version": "3.3.0", "requestId": "3c1b1722-369d-41f9-8232-cb0bde86dd12", "warehouseCode": "geekplus"}}}', '2026-04-13 19:40:48', '2026-04-13 19:40:48'),
	('3366978', '8003a811-83b2-40cb-a5af-dd0e7e359e18', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366978, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "taskPhase": "GO_FETCHING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602830", "destHostCode": "22602830", "destLocation": {"x": 22.6, "y": 28.39, "z": 1}}, "header": {"version": "3.3.0", "requestId": "8003a811-83b2-40cb-a5af-dd0e7e359e18", "warehouseCode": "geekplus"}}}', '2026-04-13 19:40:36', '2026-04-13 19:40:36'),
	('3366978', '9a79afa4-cef8-4632-90eb-1a967b0cfe44', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366978, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "taskPhase": "GO_RETURN", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002830", "destHostCode": "27002830", "destLocation": {"x": 26.96, "y": 28.39, "z": 1}}, "header": {"version": "3.3.0", "requestId": "9a79afa4-cef8-4632-90eb-1a967b0cfe44", "warehouseCode": "geekplus"}}}', '2026-04-13 19:40:59', '2026-04-13 19:40:59'),
	('3366978', 'f1b502ce-ae23-4614-b7be-05bdf31eaf0a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366978, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "taskPhase": "SHELF_ARRIVED", "taskStatus": "COMPLETED", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002830", "destHostCode": "27002830", "destLocation": {"x": 26.96, "y": 28.39, "z": 1}}, "header": {"version": "3.3.0", "requestId": "f1b502ce-ae23-4614-b7be-05bdf31eaf0a", "warehouseCode": "geekplus"}}}', '2026-04-13 19:41:17', '2026-04-13 19:41:17'),
	('3366980', '122779af-ee13-4378-a6c5-28df7590e0f2', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "GO_RETURN", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002700", "destHostCode": "27002700", "destLocation": {"x": 26.956, "y": 26.732, "z": 1}}, "header": {"version": "3.3.0", "requestId": "122779af-ee13-4378-a6c5-28df7590e0f2", "warehouseCode": "geekplus"}}}', '2026-04-13 19:45:54', '2026-04-13 19:45:54'),
	('3366980', '29ce9323-34b0-4b80-aa30-2273324ee95c', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "B", "taskPhase": "GO_DELIVERING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602700", "destHostCode": "22602700", "destLocation": {"x": 22.6, "y": 26.75, "z": 1}}, "header": {"version": "3.3.0", "requestId": "29ce9323-34b0-4b80-aa30-2273324ee95c", "warehouseCode": "geekplus"}}}', '2026-04-13 19:45:27', '2026-04-13 19:45:27'),
	('3366980', '7fbe96c3-e7c5-4b8b-9209-7514cf64de0f', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "B", "taskPhase": "SHELF_TURNING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602700", "destHostCode": "22602700", "destLocation": {"x": 22.6, "y": 26.75, "z": 1}}, "header": {"version": "3.3.0", "requestId": "7fbe96c3-e7c5-4b8b-9209-7514cf64de0f", "warehouseCode": "geekplus"}}}', '2026-04-13 19:45:45', '2026-04-13 19:45:45'),
	('3366980', '8fc1d882-f565-4735-8488-0d0ab5521901', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "B", "taskPhase": "SHELF_FETCHED", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232030", "destHostCode": "21232030", "destLocation": {"x": 21.23, "y": 20.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "8fc1d882-f565-4735-8488-0d0ab5521901", "warehouseCode": "geekplus"}}}', '2026-04-13 19:45:22', '2026-04-13 19:45:22'),
	('3366980', 'caf2b388-49e6-4b91-b20a-c8379df088d4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "SHELF_ARRIVED", "taskStatus": "COMPLETED", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002700", "destHostCode": "27002700", "destLocation": {"x": 26.956, "y": 26.732, "z": 1}}, "header": {"version": "3.3.0", "requestId": "caf2b388-49e6-4b91-b20a-c8379df088d4", "warehouseCode": "geekplus"}}}', '2026-04-13 19:46:24', '2026-04-13 19:46:24'),
	('3366980', 'cbac7b5e-109f-47dc-890a-46bf4cea0ff3', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3366980, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "F", "taskPhase": "GO_FETCHING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232030", "destHostCode": "21232030", "destLocation": {"x": 21.23, "y": 20.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "cbac7b5e-109f-47dc-890a-46bf4cea0ff3", "warehouseCode": "geekplus"}}}', '2026-04-13 19:44:37', '2026-04-13 19:44:37'),
	('3367058', 'c012bfed-205d-435e-962c-123b1636068b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367058, "robotId": 3455055, "waitDir": -1, "taskType": "GO_WORK", "taskPhase": "MOVING", "taskStatus": "EXECUTING", "instruction": "GO_NEXT", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232430", "destHostCode": "21232430", "destLocation": {"x": 21.23, "y": 24.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "c012bfed-205d-435e-962c-123b1636068b", "warehouseCode": "geekplus"}}}', '2026-04-13 20:15:00', '2026-04-13 20:15:00'),
	('3367058', 'f5dd8180-cab8-4544-b4ba-bfbbbf181a03', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367058, "robotId": 3455055, "waitDir": -1, "taskType": "GO_WORK", "taskPhase": "ARRIVED", "taskStatus": "COMPLETED", "instruction": "GO_NEXT", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232430", "destHostCode": "21232430", "destLocation": {"x": 21.23, "y": 24.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "f5dd8180-cab8-4544-b4ba-bfbbbf181a03", "warehouseCode": "geekplus"}}}', '2026-04-13 20:15:41', '2026-04-13 20:15:41'),
	('3367059', '146d22f5-8df9-478d-801b-1682387b3bb0', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367059, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "shelfSide": "L", "taskPhase": "GO_FETCHING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "25002700", "destHostCode": "25002700", "destLocation": {"x": 24.996, "y": 26.742, "z": 1}}, "header": {"version": "3.3.0", "requestId": "146d22f5-8df9-478d-801b-1682387b3bb0", "warehouseCode": "geekplus"}}}', '2026-04-13 20:16:21', '2026-04-13 20:16:21'),
	('3367059', '4ee65c69-1246-4bc7-b52a-3d38b9eabe8a', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367059, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "shelfSide": "L", "taskPhase": "SHELF_FETCHED", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "25002700", "destHostCode": "25002700", "destLocation": {"x": 24.996, "y": 26.742, "z": 1}}, "header": {"version": "3.3.0", "requestId": "4ee65c69-1246-4bc7-b52a-3d38b9eabe8a", "warehouseCode": "geekplus"}}}', '2026-04-13 20:16:25', '2026-04-13 20:16:25'),
	('3367059', 'e6f5e503-644c-4f57-8dcd-4f4b129ec1d4', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367059, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "shelfSide": "L", "taskPhase": "GO_RETURN", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232430", "destHostCode": "21232430", "destLocation": {"x": 21.23, "y": 24.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "e6f5e503-644c-4f57-8dcd-4f4b129ec1d4", "warehouseCode": "geekplus"}}}', '2026-04-13 20:16:38', '2026-04-13 20:16:38'),
	('3367059', 'f496dae1-17cb-4a62-a4ea-851153457645', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367059, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0011", "shelfSide": "B", "taskPhase": "SHELF_ARRIVED", "taskStatus": "COMPLETED", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232430", "destHostCode": "21232430", "destLocation": {"x": 21.23, "y": 24.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "f496dae1-17cb-4a62-a4ea-851153457645", "warehouseCode": "geekplus"}}}', '2026-04-13 20:17:26', '2026-04-13 20:17:26'),
	('3367060', '01c2cb66-ec7a-499c-8e4d-478182462400', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "GO_DELIVERING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602700", "destHostCode": "22602700", "destLocation": {"x": 22.6, "y": 26.75, "z": 1}}, "header": {"version": "3.3.0", "requestId": "01c2cb66-ec7a-499c-8e4d-478182462400", "warehouseCode": "geekplus"}}}', '2026-04-13 20:18:26', '2026-04-13 20:18:26'),
	('3367060', '23ba74a7-3c57-46f3-a1a0-5e1044155b0e', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "B", "taskPhase": "GO_RETURN", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232030", "destHostCode": "21232030", "destLocation": {"x": 21.23, "y": 20.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "23ba74a7-3c57-46f3-a1a0-5e1044155b0e", "warehouseCode": "geekplus"}}}', '2026-04-13 20:18:49', '2026-04-13 20:18:49'),
	('3367060', '7b9c15ee-4b08-4f4c-aa76-71867aaced9b', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "SHELF_FETCHED", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002700", "destHostCode": "27002700", "destLocation": {"x": 26.956, "y": 26.732, "z": 1}}, "header": {"version": "3.3.0", "requestId": "7b9c15ee-4b08-4f4c-aa76-71867aaced9b", "warehouseCode": "geekplus"}}}', '2026-04-13 20:18:17', '2026-04-13 20:18:17'),
	('3367060', '8b2fa80c-4b9c-4c2c-b1e8-e73263e27f07', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "GO_FETCHING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "27002700", "destHostCode": "27002700", "destLocation": {"x": 26.956, "y": 26.732, "z": 1}}, "header": {"version": "3.3.0", "requestId": "8b2fa80c-4b9c-4c2c-b1e8-e73263e27f07", "warehouseCode": "geekplus"}}}', '2026-04-13 20:17:42', '2026-04-13 20:17:42'),
	('3367060', 'a577a6e2-6cbb-4a6e-93b1-9a092c7be02f', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "B", "taskPhase": "SHELF_ARRIVED", "taskStatus": "COMPLETED", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "21232030", "destHostCode": "21232030", "destLocation": {"x": 21.23, "y": 20.2, "z": 1}}, "header": {"version": "3.3.0", "requestId": "a577a6e2-6cbb-4a6e-93b1-9a092c7be02f", "warehouseCode": "geekplus"}}}', '2026-04-13 20:19:10', '2026-04-13 20:19:10'),
	('3367060', 'e57a1883-b0ed-4424-be87-cb4d16b1235c', '{"id": "clientid", "msgType": "RobotTaskCallbackMsg", "request": {"body": {"taskId": 3367060, "robotId": 3455055, "waitDir": -1, "taskType": "DELIVER_SHELF", "shelfCode": "OKE0007", "shelfSide": "L", "taskPhase": "SHELF_TURNING", "taskStatus": "EXECUTING", "instruction": "GO_RETURN", "taskFailure": {"startWaitTime": 0, "taskFailureCode": 0, "waitingForChargingTaskExecutionTime": 0}, "destCellCode": "22602700", "destHostCode": "22602700", "destLocation": {"x": 22.6, "y": 26.75, "z": 1}}, "header": {"version": "3.3.0", "requestId": "e57a1883-b0ed-4424-be87-cb4d16b1235c", "warehouseCode": "geekplus"}}}', '2026-04-13 20:18:34', '2026-04-13 20:18:34');

--  テーブル futaba_ok2_shippment.t_callback_task_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_callback_task_status` (
  `task_id` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'タスクID',
  `status` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Status',
  `phase` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Phase',
  `robot_id` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Robot ID',
  `dest_cell` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Dest Cell',
  `task_type` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Task Type',
  `instruction` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Instruction',
  `created_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時',
  PRIMARY KEY (`task_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_callback_task_status: ~148 rows (約) のデータをダンプしています
DELETE FROM `t_callback_task_status`;
INSERT INTO `t_callback_task_status` (`task_id`, `status`, `phase`, `robot_id`, `dest_cell`, `task_type`, `instruction`, `created_date`, `updated_date`) VALUES
	('3347443', 'COMPLETED', '', '3455052', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-11 00:49:16', '2026-04-11 00:49:16'),
	('3361149', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:06', '2026-04-13 00:07:06'),
	('3361150', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:03', '2026-04-13 00:07:03'),
	('3361152', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:06:50', '2026-04-13 00:06:50'),
	('3361153', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:06:58', '2026-04-13 00:06:58'),
	('3361154', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:06:54', '2026-04-13 00:06:54'),
	('3361155', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:06:52', '2026-04-13 00:06:52'),
	('3361156', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:09', '2026-04-13 00:07:09'),
	('3361157', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:10', '2026-04-13 00:07:10'),
	('3361158', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:21', '2026-04-13 00:07:21'),
	('3361159', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:17', '2026-04-13 00:07:17'),
	('3361160', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:11', '2026-04-13 00:07:11'),
	('3361161', 'CANCELED', '', '', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 00:07:13', '2026-04-13 00:07:13'),
	('3364340', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364342', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364343', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364350', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:07', '2026-04-13 01:42:07'),
	('3364352', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364353', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364354', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364355', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364356', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364357', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364358', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364359', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364360', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364361', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364362', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364363', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364365', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364366', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364367', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364368', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364369', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364370', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364371', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364372', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364373', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364374', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364375', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364376', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364378', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364379', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364380', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364381', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364382', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364383', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364384', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364385', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364386', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364387', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364390', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364391', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364392', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364393', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364394', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364395', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364396', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364397', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364398', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364399', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364400', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364401', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364402', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364403', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364405', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364406', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364407', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364408', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364409', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364410', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364412', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364413', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364414', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364415', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364416', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364417', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364418', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364419', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364420', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364421', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364429', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364433', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364434', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364438', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:27', '2026-04-13 01:42:27'),
	('3364440', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364441', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364442', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:17', '2026-04-13 01:42:17'),
	('3364444', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364448', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364449', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364450', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364451', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364452', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364454', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364455', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364464', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364465', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364466', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364467', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:06', '2026-04-13 01:42:06'),
	('3364468', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364469', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364470', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364471', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364472', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364473', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364474', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364475', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364476', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364477', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364478', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364479', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364480', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364486', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364495', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364496', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364497', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364502', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364506', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364508', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364510', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364512', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364514', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364515', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364516', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364517', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364518', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364522', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364524', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364526', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364528', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364529', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364530', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364531', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364532', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364533', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364534', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364535', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364536', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364538', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364539', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364546', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364547', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364550', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364551', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364554', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:28', '2026-04-13 01:42:28'),
	('3364556', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3364560', 'COMPLETED', '', '3455050', '', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 01:42:38', '2026-04-13 01:42:38'),
	('3366978', 'COMPLETED', 'SHELF_ARRIVED', '3455055', '27002830', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 19:40:36', '2026-04-13 19:41:17'),
	('3366980', 'COMPLETED', 'SHELF_ARRIVED', '3455055', '27002700', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 19:44:37', '2026-04-13 19:46:24'),
	('3367058', 'COMPLETED', 'ARRIVED', '3455055', '21232430', 'GO_WORK', 'GO_NEXT', '2026-04-13 20:15:00', '2026-04-13 20:15:41'),
	('3367059', 'COMPLETED', 'SHELF_ARRIVED', '3455055', '21232430', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 20:16:21', '2026-04-13 20:17:26'),
	('3367060', 'COMPLETED', 'SHELF_ARRIVED', '3455055', '21232030', 'DELIVER_SHELF', 'GO_RETURN', '2026-04-13 20:17:42', '2026-04-13 20:19:10');

--  テーブル futaba_ok2_shippment.t_error_log の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_error_log` (
  `error_num` int NOT NULL COMMENT 'エラーID',
  `error_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'エラーコード',
  `task_id` int DEFAULT NULL COMMENT 'タスクID',
  `robot_id` int NOT NULL COMMENT 'ロボットID',
  `error_datetime` datetime NOT NULL DEFAULT (now()) COMMENT 'エラー発生時刻(yyyy/MM/dd hh:mm:ss)',
  `is_completed` bit(1) NOT NULL COMMENT '完了状況',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時(yyyy/MM/dd hh:mm:ss)',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '変更日時(yyyy/MM/dd hh:mm:ss)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_error_log: ~75 rows (約) のデータをダンプしています
DELETE FROM `t_error_log`;
INSERT INTO `t_error_log` (`error_num`, `error_code`, `task_id`, `robot_id`, `error_datetime`, `is_completed`, `created_date`, `updated_date`) VALUES
	(1476, 'E112011', 3341002, 3442006, '2025-04-28 17:40:00', b'0', '2025-04-28 17:40:07', '2026-04-02 23:40:35'),
	(1477, 'E121000', 3341002, 3442006, '2025-04-28 17:42:25', b'0', '2025-04-28 17:42:54', '2026-04-02 23:40:57'),
	(1478, 'E112000', 3341002, 3442006, '2025-04-28 17:43:36', b'0', '2025-04-28 17:43:45', '2026-04-02 23:40:54'),
	(1480, 'E112003', NULL, 3441935, '2025-04-28 17:49:07', b'0', '2025-04-28 17:49:18', '2026-04-02 23:40:49'),
	(1481, 'E121111', NULL, 3441935, '2025-04-28 17:49:23', b'0', '2025-04-28 17:49:29', '2026-04-02 23:40:45'),
	(1482, 'E121111', NULL, 3442005, '2025-04-28 17:49:15', b'0', '2025-04-28 17:49:29', '2026-04-02 23:40:43'),
	(1483, 'E121057', NULL, 3441935, '2025-04-28 17:50:15', b'0', '2025-04-28 17:50:19', '2026-04-02 23:40:40'),
	(1484, 'E112007', 3341003, 3442005, '2025-04-28 17:51:41', b'0', '2025-04-28 17:51:51', '2026-04-02 23:40:37'),
	(1485, 'E121108', 3341003, 3442005, '2025-04-28 17:52:56', b'0', '2025-04-28 17:53:02', '2026-04-02 23:40:09'),
	(1486, 'E121111', 3341003, 3442005, '2025-04-28 17:53:08', b'0', '2025-04-28 17:53:21', '2026-04-02 23:40:33'),
	(1487, 'E112000', 3341003, 3442005, '2025-04-28 17:53:46', b'0', '2025-04-28 17:53:48', '2026-04-02 23:40:29'),
	(1488, 'E121111', NULL, 3441935, '2025-04-28 17:54:43', b'0', '2025-04-28 17:54:52', '2026-04-02 23:40:27'),
	(1489, 'E121000', 3341004, 3441935, '2025-04-28 17:57:04', b'0', '2025-04-28 17:57:19', '2026-04-02 23:40:24'),
	(1490, 'E112011', 3341004, 3441935, '2025-04-28 17:57:58', b'0', '2025-04-28 17:58:07', '2026-04-02 23:40:22'),
	(1491, 'E121111', 3341003, 3442005, '2025-04-28 18:01:13', b'0', '2025-04-28 18:01:27', '2026-04-02 23:40:19'),
	(1492, 'E121072', 3341003, 3442005, '2025-04-28 18:01:28', b'0', '2025-04-28 18:01:34', '2026-04-02 23:40:17'),
	(1493, 'E112000', 3341004, 3441935, '2025-04-28 18:01:39', b'0', '2025-04-28 18:01:48', '2026-04-02 23:40:14'),
	(1494, 'E112000', 3341003, 3442005, '2025-04-28 18:02:38', b'0', '2025-04-28 18:02:41', '2026-04-02 23:40:11'),
	(1476, 'E112011', 3341002, 3442006, '2025-04-28 17:40:00', b'1', '2025-04-28 17:40:07', '2026-04-02 23:38:41'),
	(1477, 'E121000', 3341002, 3442006, '2025-04-28 17:42:25', b'1', '2025-04-28 17:42:54', '2026-04-02 22:22:28'),
	(1478, 'E112000', 3341002, 3442006, '2025-04-28 17:43:36', b'1', '2025-04-28 17:43:45', '2026-04-02 23:31:17'),
	(1479, 'E112003', NULL, 3442005, '2025-04-28 17:49:00', b'0', '2025-04-28 17:49:04', '2026-04-02 23:40:51'),
	(1480, 'E112003', NULL, 3441935, '2025-04-28 17:49:07', b'1', '2025-04-28 17:49:18', '2026-04-02 22:21:54'),
	(1481, 'E121111', NULL, 3441935, '2025-04-28 17:49:23', b'1', '2025-04-28 17:49:29', '2026-04-02 19:07:56'),
	(1482, 'E121111', NULL, 3442005, '2025-04-28 17:49:15', b'1', '2025-04-28 17:49:29', '2026-04-02 22:21:47'),
	(1483, 'E121057', NULL, 3441935, '2025-04-28 17:50:15', b'1', '2025-04-28 17:50:19', '2025-04-28 17:50:37'),
	(1484, 'E112007', 3341003, 3442005, '2025-04-28 17:51:41', b'1', '2025-04-28 17:51:51', '2025-04-28 18:01:27'),
	(1485, 'E121108', 3341003, 3442005, '2025-04-28 17:52:56', b'1', '2025-04-28 17:53:02', '2025-04-28 17:53:48'),
	(1486, 'E121111', 3341003, 3442005, '2025-04-28 17:53:08', b'1', '2025-04-28 17:53:21', '2025-04-28 17:53:39'),
	(1487, 'E112000', 3341003, 3442005, '2025-04-28 17:53:46', b'1', '2025-04-28 17:53:48', '2025-04-28 18:01:27'),
	(1488, 'E121111', NULL, 3441935, '2025-04-28 17:54:43', b'1', '2025-04-28 17:54:52', '2025-04-28 17:55:02'),
	(1489, 'E121000', 3341004, 3441935, '2025-04-28 17:57:04', b'1', '2025-04-28 17:57:19', '2025-04-28 18:01:48'),
	(1490, 'E112011', 3341004, 3441935, '2025-04-28 17:57:58', b'1', '2025-04-28 17:58:07', '2025-04-28 18:01:48'),
	(1491, 'E121111', 3341003, 3442005, '2025-04-28 18:01:13', b'1', '2025-04-28 18:01:27', '2025-04-28 18:01:34'),
	(1492, 'E121072', 3341003, 3442005, '2025-04-28 18:01:28', b'1', '2025-04-28 18:01:34', '2025-04-28 18:02:41'),
	(1493, 'E112000', 3341004, 3441935, '2025-04-28 18:01:39', b'1', '2025-04-28 18:01:48', '2025-04-28 18:09:08'),
	(1494, 'E112000', 3341003, 3442005, '2025-04-28 18:02:38', b'1', '2025-04-28 18:02:41', '2025-04-28 18:10:11'),
	(1476, 'E112011', 3341002, 3442006, '2025-04-28 17:40:00', b'1', '2025-04-28 17:40:07', '2026-04-02 23:38:41'),
	(1477, 'E121000', 3341002, 3442006, '2025-04-28 17:42:25', b'1', '2025-04-28 17:42:54', '2026-04-02 22:22:28'),
	(1478, 'E112000', 3341002, 3442006, '2025-04-28 17:43:36', b'1', '2025-04-28 17:43:45', '2026-04-02 23:31:17'),
	(1479, 'E112003', NULL, 3442005, '2025-04-28 17:49:00', b'1', '2025-04-28 17:49:04', '2025-04-28 17:49:46'),
	(1480, 'E112003', NULL, 3441935, '2025-04-28 17:49:07', b'1', '2025-04-28 17:49:18', '2026-04-02 22:21:54'),
	(1481, 'E121111', NULL, 3441935, '2025-04-28 17:49:23', b'1', '2025-04-28 17:49:29', '2026-04-02 19:07:56'),
	(1482, 'E121111', NULL, 3442005, '2025-04-28 17:49:15', b'1', '2025-04-28 17:49:29', '2026-04-02 22:21:47'),
	(1483, 'E121057', NULL, 3441935, '2025-04-28 17:50:15', b'1', '2025-04-28 17:50:19', '2025-04-28 17:50:37'),
	(1484, 'E112007', 3341003, 3442005, '2025-04-28 17:51:41', b'1', '2025-04-28 17:51:51', '2025-04-28 18:01:27'),
	(1485, 'E121108', 3341003, 3442005, '2025-04-28 17:52:56', b'1', '2025-04-28 17:53:02', '2025-04-28 17:53:48'),
	(1486, 'E121111', 3341003, 3442005, '2025-04-28 17:53:08', b'1', '2025-04-28 17:53:21', '2025-04-28 17:53:39'),
	(1487, 'E112000', 3341003, 3442005, '2025-04-28 17:53:46', b'1', '2025-04-28 17:53:48', '2025-04-28 18:01:27'),
	(1488, 'E121111', NULL, 3441935, '2025-04-28 17:54:43', b'1', '2025-04-28 17:54:52', '2025-04-28 17:55:02'),
	(1489, 'E121000', 3341004, 3441935, '2025-04-28 17:57:04', b'1', '2025-04-28 17:57:19', '2025-04-28 18:01:48'),
	(1490, 'E112011', 3341004, 3441935, '2025-04-28 17:57:58', b'1', '2025-04-28 17:58:07', '2025-04-28 18:01:48'),
	(1491, 'E121111', 3341003, 3442005, '2025-04-28 18:01:13', b'1', '2025-04-28 18:01:27', '2025-04-28 18:01:34'),
	(1492, 'E121072', 3341003, 3442005, '2025-04-28 18:01:28', b'1', '2025-04-28 18:01:34', '2025-04-28 18:02:41'),
	(1493, 'E112000', 3341004, 3441935, '2025-04-28 18:01:39', b'1', '2025-04-28 18:01:48', '2025-04-28 18:09:08'),
	(1494, 'E112000', 3341003, 3442005, '2025-04-28 18:02:38', b'1', '2025-04-28 18:02:41', '2025-04-28 18:10:11'),
	(1476, 'E112011', 3341002, 3442006, '2025-04-28 17:40:00', b'1', '2025-04-28 17:40:07', '2026-04-02 23:38:41'),
	(1477, 'E121000', 3341002, 3442006, '2025-04-28 17:42:25', b'1', '2025-04-28 17:42:54', '2026-04-02 22:22:28'),
	(1478, 'E112000', 3341002, 3442006, '2025-04-28 17:43:36', b'1', '2025-04-28 17:43:45', '2026-04-02 23:31:17'),
	(1479, 'E112003', NULL, 3442005, '2025-04-28 17:49:00', b'1', '2025-04-28 17:49:04', '2025-04-28 17:49:46'),
	(1480, 'E112003', NULL, 3441935, '2025-04-28 17:49:07', b'1', '2025-04-28 17:49:18', '2026-04-02 22:21:54'),
	(1481, 'E121111', NULL, 3441935, '2025-04-28 17:49:23', b'1', '2025-04-28 17:49:29', '2026-04-02 19:07:56'),
	(1482, 'E121111', NULL, 3442005, '2025-04-28 17:49:15', b'1', '2025-04-28 17:49:29', '2026-04-02 22:21:47'),
	(1483, 'E121057', NULL, 3441935, '2025-04-28 17:50:15', b'1', '2025-04-28 17:50:19', '2025-04-28 17:50:37'),
	(1484, 'E112007', 3341003, 3442005, '2025-04-28 17:51:41', b'1', '2025-04-28 17:51:51', '2025-04-28 18:01:27'),
	(1485, 'E121108', 3341003, 3442005, '2025-04-28 17:52:56', b'1', '2025-04-28 17:53:02', '2025-04-28 17:53:48'),
	(1486, 'E121111', 3341003, 3442005, '2025-04-28 17:53:08', b'1', '2025-04-28 17:53:21', '2025-04-28 17:53:39'),
	(1487, 'E112000', 3341003, 3442005, '2025-04-28 17:53:46', b'1', '2025-04-28 17:53:48', '2025-04-28 18:01:27'),
	(1488, 'E121111', NULL, 3441935, '2025-04-28 17:54:43', b'1', '2025-04-28 17:54:52', '2025-04-28 17:55:02'),
	(1489, 'E121000', 3341004, 3441935, '2025-04-28 17:57:04', b'1', '2025-04-28 17:57:19', '2025-04-28 18:01:48'),
	(1490, 'E112011', 3341004, 3441935, '2025-04-28 17:57:58', b'1', '2025-04-28 17:58:07', '2025-04-28 18:01:48'),
	(1491, 'E121111', 3341003, 3442005, '2025-04-28 18:01:13', b'1', '2025-04-28 18:01:27', '2025-04-28 18:01:34'),
	(1492, 'E121072', 3341003, 3442005, '2025-04-28 18:01:28', b'1', '2025-04-28 18:01:34', '2025-04-28 18:02:41'),
	(1493, 'E112000', 3341004, 3441935, '2025-04-28 18:01:39', b'1', '2025-04-28 18:01:48', '2025-04-28 18:09:08'),
	(1494, 'E112000', 3341003, 3442005, '2025-04-28 18:02:38', b'1', '2025-04-28 18:02:41', '2025-04-28 18:10:11');

--  テーブル futaba_ok2_shippment.t_kotatsu_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_kotatsu_status` (
  `kotatsu_id` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'コタツID',
  `loaded_pallet_id` int DEFAULT NULL COMMENT '積載パレットID',
  `cell_code` int DEFAULT NULL COMMENT '現在位置',
  `booking` tinyint(1) NOT NULL DEFAULT '0' COMMENT '予約(0:無し、1:有り)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_kotatsu_status: ~14 rows (約) のデータをダンプしています
DELETE FROM `t_kotatsu_status`;
INSERT INTO `t_kotatsu_status` (`kotatsu_id`, `loaded_pallet_id`, `cell_code`, `booking`, `created_date`, `updated_date`) VALUES
	('OKE0001', NULL, 27643720, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0002', NULL, 25743720, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0003', NULL, 27644368, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0004', NULL, 25744368, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0005', NULL, 21233530, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0006', NULL, 21233330, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0007', NULL, 21232030, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0008', NULL, 21232230, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0009', NULL, 21233130, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0010', NULL, 27001000, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0011', NULL, 21232430, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0012', NULL, 25001000, 0, '2026-03-06 11:55:00', '2026-04-13 20:41:35'),
	('OKE0013', NULL, NULL, 0, '2026-03-19 21:59:55', '2026-04-13 20:02:18'),
	('OKE0014', NULL, NULL, 0, '2026-03-19 21:59:57', '2026-04-13 20:02:22');

--  テーブル futaba_ok2_shippment.t_lift_station の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_lift_station` (
  `plat_no` int NOT NULL COMMENT 'plat番号',
  `seq_no` int NOT NULL COMMENT 'seq番号',
  `pallet_id` int DEFAULT NULL COMMENT 'パレットID',
  `transport_status` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '搬送ステータス(READY, WORK, WAIT, COMP)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_lift_station: ~6 rows (約) のデータをダンプしています
DELETE FROM `t_lift_station`;
INSERT INTO `t_lift_station` (`plat_no`, `seq_no`, `pallet_id`, `transport_status`, `created_date`, `updated_date`) VALUES
	(80, 0, 1, 'WAIT', '2026-03-09 13:47:37', '2026-04-13 19:52:43'),
	(80, 1, 9, 'COMP', '2026-03-09 13:47:46', '2026-04-13 19:55:26'),
	(80, 2, 5, 'WAIT', '2026-03-09 13:47:55', '2026-04-13 19:52:45'),
	(81, 0, 3, 'WAIT', '2026-02-27 15:26:11', '2026-04-13 19:52:55'),
	(81, 1, 7, 'WAIT', '2026-03-09 13:47:16', '2026-04-12 19:34:30'),
	(81, 2, 12, 'WAIT', '2026-03-09 13:47:28', '2026-04-13 19:52:56');

--  テーブル futaba_ok2_shippment.t_line_station の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_line_station` (
  `plat_no` int NOT NULL COMMENT 'plat番号',
  `line_id` int NOT NULL COMMENT 'ラインID',
  `pallet_id` int DEFAULT NULL COMMENT 'パレット名称',
  `status` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ステータス',
  `distination_plat` int unsigned NOT NULL COMMENT '排出プラット',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_line_station: ~4 rows (約) のデータをダンプしています
DELETE FROM `t_line_station`;
INSERT INTO `t_line_station` (`plat_no`, `line_id`, `pallet_id`, `status`, `distination_plat`, `created_date`, `updated_date`) VALUES
	(63, 1, NULL, NULL, 81, '2026-03-06 16:29:52', '2026-04-13 20:03:05'),
	(62, 2, NULL, NULL, 81, '2026-03-06 16:29:38', '2026-04-13 20:03:06'),
	(61, 3, NULL, NULL, 80, '2026-03-06 16:29:09', '2026-04-13 20:03:09'),
	(60, 4, NULL, '', 80, '2026-03-06 16:26:16', '2026-04-13 20:03:12');

--  テーブル futaba_ok2_shippment.t_line_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_line_status` (
  `line_id` int NOT NULL COMMENT 'ラインID',
  `request_flag` tinyint(1) NOT NULL COMMENT '搬出要求flag(1 =要求 , 0 = なし)',
  `request_execution` tinyint(1) NOT NULL DEFAULT (0) COMMENT '搬送状況',
  `request_time` datetime DEFAULT NULL COMMENT '要求時間(yyyy/MM/dd hh:mm:ss)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_line_status: ~4 rows (約) のデータをダンプしています
DELETE FROM `t_line_status`;
INSERT INTO `t_line_status` (`line_id`, `request_flag`, `request_execution`, `request_time`, `created_date`, `updated_date`) VALUES
	(1, 0, 0, '2026-03-06 14:37:26', '2026-02-27 15:19:02', '2026-04-13 20:02:35'),
	(2, 0, 0, '2026-03-06 16:37:30', '2026-02-27 15:19:09', '2026-04-07 23:30:26'),
	(3, 0, 0, '2026-03-06 16:37:30', '2026-03-06 16:39:09', '2026-04-13 20:02:35'),
	(4, 0, 0, '2026-03-06 16:37:30', '2026-03-06 16:39:35', '2026-04-07 23:30:33');

--  テーブル futaba_ok2_shippment.t_location の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_location` (
  `cell_code` int DEFAULT NULL COMMENT 'セルコード',
  `kotatsu_id` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'コタツID',
  `transport_permission` tinyint(1) NOT NULL DEFAULT (0) COMMENT '搬送許可(0 = 許可,1 = 禁止)',
  `has_reservation` tinyint(1) NOT NULL DEFAULT (0) COMMENT '予約有無(0 = 無し, 1 = 有)',
  `transport_status` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '搬送ステータス(READY, WORK, WAIT, COMP)',
  `created_date` datetime DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_location: ~20 rows (約) のデータをダンプしています
DELETE FROM `t_location`;
INSERT INTO `t_location` (`cell_code`, `kotatsu_id`, `transport_permission`, `has_reservation`, `transport_status`, `created_date`, `updated_date`) VALUES
	(27001000, 'OKE0010', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(25001000, 'OKE0012', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(27000830, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-03-31 02:03:28'),
	(25072660, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-08 01:48:24'),
	(27072660, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-08 00:29:29'),
	(27072830, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-03-30 19:51:46'),
	(27643720, 'OKE0001', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(25743720, 'OKE0002', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(27643848, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-08 01:48:24'),
	(27644368, 'OKE0003', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(25744368, 'OKE0004', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(27644240, NULL, 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:04:34'),
	(21233530, 'OKE0005', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(21233330, 'OKE0006', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(21233130, 'OKE0009', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(21232430, 'OKE0011', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(21232230, 'OKE0008', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(21232030, 'OKE0007', 0, 0, NULL, '2026-03-06 15:47:44', '2026-04-13 20:41:35'),
	(23051000, NULL, 0, 0, NULL, '2026-03-31 00:59:30', '2026-04-10 22:49:23'),
	(23102660, NULL, 0, 0, NULL, '2026-03-31 00:59:44', '2026-04-08 01:48:24');

--  テーブル futaba_ok2_shippment.t_pallet_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_pallet_status` (
  `pallet_id` int NOT NULL COMMENT 'パレットID',
  `status` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'ステータス("FILL", "EMPTY")',
  `pallet_type` int NOT NULL DEFAULT (0) COMMENT 'パレット種類',
  `input_time` datetime DEFAULT NULL COMMENT '投入時間(yyyy/MM/dd hh:mm:ss)',
  `completion_time` datetime DEFAULT NULL COMMENT '完成時間(yyyy/MM/dd hh:mm:ss)',
  `created_date` timestamp NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` timestamp NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_pallet_status: ~12 rows (約) のデータをダンプしています
DELETE FROM `t_pallet_status`;
INSERT INTO `t_pallet_status` (`pallet_id`, `status`, `pallet_type`, `input_time`, `completion_time`, `created_date`, `updated_date`) VALUES
	(1, 'EMPTY', 31, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-08 18:00:35'),
	(2, 'EMPTY', 33, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-13 10:53:27'),
	(3, 'EMPTY', 1, '2026-04-13 20:01:25', '2026-04-13 20:03:03', '2026-03-06 02:55:00', '2026-04-13 11:03:59'),
	(4, 'EMPTY', 34, '2026-04-13 01:19:54', '2026-04-13 20:03:03', '2026-03-06 02:55:00', '2026-04-13 11:03:03'),
	(5, 'EMPTY', 13, '2026-04-13 01:19:54', '2026-04-13 20:03:03', '2026-03-06 02:55:00', '2026-04-13 11:04:00'),
	(6, 'EMPTY', 24, '2026-04-13 19:58:51', '2026-04-13 20:02:52', '2026-03-06 02:55:00', '2026-04-13 11:04:01'),
	(7, 'EMPTY', 1, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-08 18:00:43'),
	(8, 'EMPTY', 12, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-08 15:07:49'),
	(9, 'EMPTY', 1, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-13 11:04:02'),
	(10, 'EMPTY', 11, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-03-30 16:21:00'),
	(11, 'EMPTY', 11, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-08 15:07:49'),
	(12, 'EMPTY', 32, '2026-03-06 11:55:00', '2026-03-06 16:37:30', '2026-03-06 02:55:00', '2026-04-08 18:00:44');

--  テーブル futaba_ok2_shippment.t_pallet_supply_pairs の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_pallet_supply_pairs` (
  `id` int NOT NULL AUTO_INCREMENT,
  `line_id` int NOT NULL,
  `pair_index` int NOT NULL,
  `pallet_type` int DEFAULT NULL,
  `count` int NOT NULL DEFAULT '0',
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_line_pair` (`line_id`,`pair_index`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_pallet_supply_pairs: ~40 rows (約) のデータをダンプしています
DELETE FROM `t_pallet_supply_pairs`;
INSERT INTO `t_pallet_supply_pairs` (`id`, `line_id`, `pair_index`, `pallet_type`, `count`, `updated_date`) VALUES
	(1, 1, 1, 21, 0, '2026-03-31 00:00:32'),
	(2, 1, 1, 22, 0, '2026-03-31 00:00:35'),
	(3, 1, 1, 23, 0, '2026-03-31 00:00:37'),
	(4, 1, 1, 24, 0, '2026-03-31 00:00:37'),
	(5, 1, 1, 21, 0, '2026-03-31 00:00:39'),
	(6, 1, 1, 22, 0, '2026-03-31 00:00:43'),
	(7, 1, 1, 23, 0, '2026-03-31 00:00:45'),
	(8, 1, 2, 24, 0, '2026-03-31 00:00:47'),
	(9, 1, 2, 21, 0, '2026-03-31 00:00:47'),
	(10, 1, 2, 22, 0, '2026-03-31 00:00:50'),
	(11, 2, 2, 31, 0, '2026-03-30 23:59:25'),
	(12, 2, 0, 32, 1, '2026-03-30 23:59:29'),
	(13, 2, 3, 33, 0, '2026-03-30 23:59:33'),
	(14, 2, 3, 34, 0, '2026-03-30 23:59:37'),
	(15, 2, 3, 31, 0, '2026-03-30 23:59:41'),
	(16, 2, 1, 32, 0, '2026-03-30 23:59:43'),
	(17, 2, 4, 33, 0, '2026-03-30 23:59:46'),
	(18, 2, 4, 34, 0, '2026-03-30 23:59:50'),
	(19, 2, 4, 31, 0, '2026-03-30 23:59:54'),
	(20, 2, 2, 32, 0, '2026-03-31 00:00:05'),
	(21, 3, 1, 1, 0, '2026-03-30 23:57:05'),
	(22, 3, 2, 2, 0, '2026-03-30 23:58:40'),
	(23, 3, 3, 3, 0, '2026-03-30 23:58:42'),
	(24, 3, 4, 4, 0, '2026-03-30 23:58:43'),
	(25, 3, 1, 1, 0, '2026-03-30 23:57:12'),
	(26, 3, 2, 2, 0, '2026-03-30 23:58:47'),
	(27, 3, 3, 3, 0, '2026-03-30 23:58:48'),
	(28, 3, 4, 4, 0, '2026-03-30 23:58:51'),
	(29, 3, 1, 1, 0, '2026-03-30 23:57:23'),
	(30, 3, 2, 2, 0, '2026-03-30 23:58:53'),
	(31, 4, 7, 11, 0, '2026-03-30 23:58:08'),
	(32, 4, 5, 12, 0, '2026-03-30 23:58:10'),
	(33, 4, 8, 13, 0, '2026-03-30 23:58:12'),
	(34, 4, 8, 14, 0, '2026-03-30 23:58:15'),
	(35, 4, 8, 11, 0, '2026-03-30 23:58:16'),
	(36, 4, 6, 12, 0, '2026-03-30 23:58:18'),
	(37, 4, 9, 13, 0, '2026-03-30 23:58:21'),
	(38, 4, 9, 14, 0, '2026-03-30 23:58:23'),
	(39, 4, 9, 11, 0, '2026-03-30 23:58:25'),
	(40, 4, 7, 12, 0, '2026-03-30 23:58:28');

--  テーブル futaba_ok2_shippment.t_pallet_supply_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_pallet_supply_status` (
  `line_id` int NOT NULL,
  `rev` int NOT NULL DEFAULT '0',
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`line_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_pallet_supply_status: ~4 rows (約) のデータをダンプしています
DELETE FROM `t_pallet_supply_status`;
INSERT INTO `t_pallet_supply_status` (`line_id`, `rev`, `updated_date`) VALUES
	(1, 0, '2026-03-31 00:42:49'),
	(2, 0, '2026-03-31 00:42:49'),
	(3, 0, '2026-03-31 00:42:49'),
	(4, 0, '2026-03-31 00:42:49');

--  テーブル futaba_ok2_shippment.t_product の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_product` (
  `line_id` int NOT NULL COMMENT 'ラインID',
  `plan_no` int NOT NULL COMMENT '計画番号',
  `supply_pallet_type` int NOT NULL COMMENT '供給パレット種類',
  `planned_supply_qty` int NOT NULL COMMENT '供給予定数',
  `completed_supply_qty` int NOT NULL COMMENT '供給完了数',
  `updated_time` datetime NOT NULL COMMENT '更新日時(yyyy/MM/dd hh:mm:ss)',
  `created_time` datetime NOT NULL COMMENT '生成時間(yyyy/MM/dd hh:mm:ss)',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_product: ~0 rows (約) のデータをダンプしています
DELETE FROM `t_product`;

--  テーブル futaba_ok2_shippment.t_rms_error の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_rms_error` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Local Unique ID',
  `athena_id` int NOT NULL COMMENT 'Original ID from Athena t_monitor_exception_capture',
  `system_code` int NOT NULL COMMENT 'Error Number (e.g., 13001). Links to m_error.rms_error_code',
  `fault_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0:Active, 1:Resolved',
  `occurrence_time` datetime NOT NULL COMMENT 'Taken from Athena create_time',
  `device_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Taken from Athena ext3 (Robot/Equipment ID)',
  `cell_code` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'Storage/Location code from Athena',
  `is_completed` tinyint DEFAULT '0' COMMENT '0:Enabled, 1:Disabled',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Local sync timestamp',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `athena_id` (`athena_id`),
  KEY `idx_system_code` (`system_code`),
  KEY `idx_occurrence` (`occurrence_time`)
) ENGINE=InnoDB AUTO_INCREMENT=817 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_rms_error: ~99 rows (約) のデータをダンプしています
DELETE FROM `t_rms_error`;
INSERT INTO `t_rms_error` (`id`, `athena_id`, `system_code`, `fault_status`, `occurrence_time`, `device_id`, `cell_code`, `is_completed`, `created_at`, `updated_at`) VALUES
	(12, 19562, 13001, 0, '2026-03-17 21:16:52', '1', '23761714', 1, '2026-03-19 20:28:55', '2026-04-02 23:31:09'),
	(83, 19491, 13001, 0, '2026-03-13 00:31:48', '1', '23761714', 1, '2026-03-19 20:28:57', '2026-04-02 19:09:23'),
	(109, 19465, 13001, 0, '2026-03-12 21:20:27', '1', '23761714', 0, '2026-03-19 20:28:57', '2026-03-19 20:32:00'),
	(140, 19434, 13001, 0, '2026-03-12 21:03:56', '1', '23761714', 0, '2026-03-19 20:28:58', '2026-03-19 20:32:01'),
	(169, 19405, 13001, 0, '2026-03-12 20:56:08', '1', '23761714', 0, '2026-03-19 20:28:59', '2026-03-19 20:32:01'),
	(284, 19290, 13001, 0, '2026-03-12 19:49:42', '1', '23761714', 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(286, 19262, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(287, 19263, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(288, 19264, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(289, 19265, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(290, 19266, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(291, 19267, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(292, 19268, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(293, 19269, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(294, 19270, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(295, 19271, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(296, 19272, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:01', '2026-03-19 20:32:04'),
	(297, 19273, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(298, 19274, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(299, 19275, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(300, 19276, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 1, '2026-03-19 20:29:02', '2026-04-01 01:29:07'),
	(301, 19277, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(302, 19278, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(303, 19279, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(304, 19280, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(305, 19281, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(306, 19282, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(307, 19283, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(308, 19284, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(309, 19285, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(310, 19286, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(311, 19287, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(312, 19288, 102002, 0, '2026-03-12 19:48:41', NULL, NULL, 0, '2026-03-19 20:29:02', '2026-03-19 20:32:04'),
	(342, 19232, 13000, 0, '2026-03-12 19:32:57', '1', '23761714', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(343, 19205, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(344, 19206, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(345, 19207, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(346, 19208, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(347, 19209, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(348, 19210, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(349, 19211, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(350, 19212, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(351, 19213, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(352, 19214, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(353, 19215, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(354, 19216, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(355, 19217, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(356, 19218, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(357, 19219, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(358, 19220, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(359, 19221, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(360, 19222, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(361, 19223, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(362, 19224, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(363, 19225, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(364, 19226, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(365, 19227, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(366, 19228, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:05'),
	(367, 19229, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(368, 19230, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(369, 19231, 102002, 0, '2026-03-12 19:32:46', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(370, 19201, 12016, 0, '2026-03-12 19:19:28', NULL, '21232030', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(371, 19202, 12016, 0, '2026-03-12 19:19:28', NULL, '21232230', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(372, 19203, 12016, 0, '2026-03-12 19:19:28', NULL, '21232430', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(373, 19204, 12016, 0, '2026-03-12 19:19:28', NULL, '21233130', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(374, 19200, 13001, 0, '2026-03-12 19:18:09', '1', '23761714', 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(376, 19172, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(377, 19173, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(378, 19174, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(379, 19175, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 1, '2026-03-19 20:29:03', '2026-04-09 20:56:01'),
	(380, 19176, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(381, 19177, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(382, 19178, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(383, 19179, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(384, 19180, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:03', '2026-03-19 20:32:06'),
	(385, 19181, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(386, 19182, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(387, 19183, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(388, 19184, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(389, 19185, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(390, 19186, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(391, 19187, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(392, 19188, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(393, 19189, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(394, 19190, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(395, 19191, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(396, 19192, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(397, 19193, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(398, 19194, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(399, 19195, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(400, 19196, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(401, 19197, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(402, 19198, 102002, 0, '2026-03-12 19:17:08', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(403, 19170, 12000, 0, '2026-03-11 04:00:02', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(404, 19171, 12000, 0, '2026-03-11 04:00:02', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(405, 19169, 12003, 0, '2026-03-08 04:00:02', NULL, NULL, 1, '2026-03-19 20:29:04', '2026-04-02 23:32:27'),
	(406, 19167, 12003, 0, '2026-03-07 04:00:01', NULL, NULL, 0, '2026-03-19 20:29:04', '2026-03-19 20:32:06'),
	(407, 19168, 12003, 0, '2026-03-07 04:00:01', NULL, NULL, 1, '2026-03-19 20:29:04', '2026-04-02 23:38:25'),
	(408, 19166, 12000, 0, '2026-03-06 01:48:48', NULL, NULL, 1, '2026-03-19 20:29:04', '2026-04-02 23:46:27');

--  テーブル futaba_ok2_shippment.t_robot の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_robot` (
  `id` int NOT NULL COMMENT 'ロボトID',
  `task_id` int DEFAULT NULL COMMENT 'タスクID',
  `current_cell_position` int NOT NULL COMMENT '現在セル位置',
  `operation_status` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '動状態',
  `loaded_kotatsu_id` int DEFAULT (0) COMMENT 'コタツID',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_robot: ~0 rows (約) のデータをダンプしています
DELETE FROM `t_robot`;

--  テーブル futaba_ok2_shippment.t_task の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_task` (
  `task_id` int unsigned NOT NULL COMMENT 'タスクID',
  `robot_id` int unsigned NOT NULL COMMENT 'ロボットID',
  `status` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ステータス(ACT, WORK, WAIT, COMP)',
  `start_cell` int unsigned DEFAULT NULL COMMENT 'スタートセル',
  `end_cell` int unsigned DEFAULT NULL COMMENT 'エンドセル',
  `priority` int DEFAULT NULL COMMENT '優先度',
  `task_phase` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'タスク進捗',
  `created_date` datetime NOT NULL DEFAULT (now()) COMMENT '作成日時',
  `updated_date` datetime NOT NULL DEFAULT (now()) ON UPDATE CURRENT_TIMESTAMP COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_task: ~85 rows (約) のデータをダンプしています
DELETE FROM `t_task`;
INSERT INTO `t_task` (`task_id`, `robot_id`, `status`, `start_cell`, `end_cell`, `priority`, `task_phase`, `created_date`, `updated_date`) VALUES
	(3172002, 9990003, 'EXECUTING', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 08:12:54', '2026-03-12 08:12:54'),
	(3172004, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 08:21:08', '2026-03-12 08:22:01'),
	(3172005, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 08:32:46', '2026-03-12 08:32:46'),
	(3172007, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 08:36:04', '2026-03-12 08:36:04'),
	(3172009, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 08:42:10', '2026-03-12 08:42:10'),
	(3296002, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 20:17:36', '2026-03-12 20:17:36'),
	(3298055, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 20:27:32', '2026-03-16 20:52:50'),
	(3298057, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-12 20:28:46', '2026-03-16 21:14:05'),
	(3298051, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-13 02:16:35', '2026-03-16 20:49:46'),
	(3298059, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-16 22:07:01', '2026-03-16 22:07:01'),
	(3298061, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-16 22:09:17', '2026-03-16 22:09:17'),
	(3298065, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-16 22:15:21', '2026-03-16 22:15:21'),
	(3298064, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-16 22:15:50', '2026-03-16 22:15:50'),
	(3298066, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-16 22:16:43', '2026-03-16 22:16:43'),
	(3298069, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 00:53:44', '2026-03-17 00:53:44'),
	(3298071, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 00:54:34', '2026-03-17 00:54:34'),
	(3298072, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 00:56:16', '2026-03-17 00:56:16'),
	(3298070, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 00:56:43', '2026-03-17 00:56:43'),
	(3298073, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:00:36', '2026-03-17 01:00:36'),
	(3298075, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:01:08', '2026-03-17 01:01:08'),
	(3298077, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:09:39', '2026-03-17 01:09:39'),
	(3298079, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:10:07', '2026-03-17 01:10:07'),
	(3298078, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:12:32', '2026-03-17 01:12:32'),
	(3298081, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:44:58', '2026-03-17 01:44:58'),
	(3298083, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:45:23', '2026-03-17 01:45:23'),
	(3298082, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:45:56', '2026-03-17 01:45:56'),
	(3298086, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:58:38', '2026-03-17 01:58:38'),
	(3298087, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:58:58', '2026-03-17 01:58:58'),
	(3298085, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 01:59:31', '2026-03-17 01:59:31'),
	(3298089, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:23:29', '2026-03-17 02:23:29'),
	(3298091, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:23:47', '2026-03-17 02:23:47'),
	(3298092, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:24:35', '2026-03-17 02:24:35'),
	(3298090, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:25:15', '2026-03-17 02:25:15'),
	(3298093, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:29:24', '2026-03-17 02:29:24'),
	(3298095, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:29:44', '2026-03-17 02:29:44'),
	(3298094, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:30:06', '2026-03-17 02:30:06'),
	(3298096, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:31:29', '2026-03-17 02:31:29'),
	(3298097, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:34:31', '2026-03-17 02:34:31'),
	(3298099, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:34:49', '2026-03-17 02:34:49'),
	(3298098, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:35:11', '2026-03-17 02:35:11'),
	(3298102, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:44:54', '2026-03-17 02:44:54'),
	(3298103, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:45:23', '2026-03-17 02:45:39'),
	(3298104, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:45:27', '2026-03-17 02:45:27'),
	(3298107, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:54:07', '2026-03-17 02:54:07'),
	(3298108, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:54:42', '2026-03-17 02:54:42'),
	(3298110, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:55:20', '2026-03-17 02:55:20'),
	(3298111, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 02:58:09', '2026-03-17 02:58:09'),
	(3298116, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:08:50', '2026-03-17 03:08:50'),
	(3298118, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:09:07', '2026-03-17 03:09:07'),
	(3298117, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:09:37', '2026-03-17 03:09:37'),
	(3298119, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:10:37', '2026-03-17 03:10:37'),
	(3298120, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:12:53', '2026-03-17 03:12:53'),
	(3298122, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:13:01', '2026-03-17 03:13:01'),
	(3298121, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:13:08', '2026-03-17 03:13:08'),
	(3298123, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:13:51', '2026-03-17 03:13:51'),
	(3298124, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:15:32', '2026-03-17 03:15:32'),
	(3298126, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:15:42', '2026-03-17 03:15:42'),
	(3298125, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:16:04', '2026-03-17 03:16:04'),
	(3298127, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:16:35', '2026-03-17 03:16:35'),
	(3298129, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:18:46', '2026-03-17 03:18:46'),
	(3298131, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:19:05', '2026-03-17 03:19:05'),
	(3298130, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:19:18', '2026-03-17 03:19:18'),
	(3298132, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 03:20:19', '2026-03-17 03:20:19'),
	(3298133, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 20:37:52', '2026-03-17 20:37:52'),
	(3298135, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 20:39:30', '2026-03-17 20:39:30'),
	(3298134, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 20:39:30', '2026-03-17 20:39:30'),
	(3298136, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 20:59:52', '2026-03-17 20:59:52'),
	(3298137, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 21:59:13', '2026-03-17 21:59:13'),
	(3298138, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 21:59:17', '2026-03-17 21:59:17'),
	(3299002, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 22:02:44', '2026-03-17 22:02:44'),
	(3299003, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 22:03:44', '2026-03-17 22:03:44'),
	(3299007, 9990003, 'COMPLETED', NULL, 27072830, NULL, 'SHELF_ARRIVED', '2026-03-17 22:25:24', '2026-03-17 22:25:24'),
	(3299008, 9990003, 'COMPLETED', NULL, 21232230, NULL, 'SHELF_ARRIVED', '2026-03-17 22:34:09', '2026-03-17 22:40:29'),
	(3299009, 9990003, 'COMPLETED', NULL, 25072660, NULL, 'SHELF_ARRIVED', '2026-03-17 22:35:35', '2026-03-17 22:35:45'),
	(3299015, 9990003, 'COMPLETED', NULL, 27072660, NULL, 'SHELF_ARRIVED', '2026-03-17 22:54:27', '2026-03-17 22:55:05'),
	(3299025, 9990003, 'COMPLETED', NULL, 21232430, NULL, 'SHELF_ARRIVED', '2026-03-19 22:11:43', '2026-03-19 22:22:21'),
	(3299026, 9990003, 'COMPLETED', NULL, 25001000, NULL, 'SHELF_ARRIVED', '2026-03-19 22:15:02', '2026-03-19 22:22:21'),
	(3300002, 9990003, 'COMPLETED', NULL, 21232230, NULL, 'SHELF_ARRIVED', '2026-03-20 01:09:41', '2026-03-20 01:29:05'),
	(3300003, 9990003, 'COMPLETED', NULL, 25072660, NULL, 'SHELF_ARRIVED', '2026-03-20 01:11:56', '2026-03-20 01:12:48'),
	(3300006, 9990003, 'COMPLETED', NULL, 21232430, NULL, 'SHELF_ARRIVED', '2026-03-20 01:29:38', '2026-03-20 01:33:43'),
	(3300007, 9990003, 'COMPLETED', NULL, 25072660, NULL, 'SHELF_ARRIVED', '2026-03-20 01:30:37', '2026-03-20 01:32:01'),
	(3300008, 9990003, 'COMPLETED', NULL, 27072660, NULL, 'SHELF_ARRIVED', '2026-03-26 22:17:23', '2026-03-26 22:20:36'),
	(3301012, 9990003, 'COMPLETED', NULL, 21232430, NULL, 'SHELF_ARRIVED', '2026-03-31 01:01:05', '2026-03-31 01:02:02'),
	(3301013, 9990003, 'COMPLETED', NULL, 21232430, NULL, 'SHELF_ARRIVED', '2026-03-31 01:13:35', '2026-03-31 01:14:31'),
	(3301014, 9990003, 'COMPLETED', NULL, 27001000, NULL, 'SHELF_ARRIVED', '2026-03-31 01:22:30', '2026-03-31 01:22:30');

--  テーブル futaba_ok2_shippment.t_task_status の構造をダンプしています
CREATE TABLE IF NOT EXISTS `t_task_status` (
  `task_id` int unsigned NOT NULL DEFAULT '0',
  `status` varchar(24) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `phase` varchar(24) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `robot_id` int unsigned NOT NULL DEFAULT '0',
  `dest_cell` int unsigned NOT NULL DEFAULT '0',
  `task_type` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `instruction` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `updated_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`task_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- テーブル futaba_ok2_shippment.t_task_status: ~6 rows (約) のデータをダンプしています
DELETE FROM `t_task_status`;
INSERT INTO `t_task_status` (`task_id`, `status`, `phase`, `robot_id`, `dest_cell`, `task_type`, `instruction`, `updated_date`) VALUES
	(3171009, 'EXECUTING', 'SHELF_FETCHED', 9990003, 27072660, 'DELIVER_SHELF', 'GO_RETURN', '2026-03-11 12:07:04'),
	(3171010, 'COMPLETED', 'SHELF_ARRIVED', 9990003, 27072830, 'DELIVER_SHELF', 'GO_RETURN', '2026-03-11 13:35:22'),
	(3171011, 'COMPLETED', 'SHELF_ARRIVED', 9990003, 27072830, 'DELIVER_SHELF', 'GO_RETURN', '2026-03-11 13:40:36'),
	(3171012, 'COMPLETED', 'SHELF_ARRIVED', 9990003, 27072830, 'DELIVER_SHELF', 'GO_RETURN', '2026-03-12 20:29:07'),
	(3300006, 'COMPLETED', 'SHELF_ARRIVED', 9990003, 21232430, 'DELIVER_SHELF', 'READY', '2026-03-20 01:33:43'),
	(3300008, 'COMPLETED', 'SHELF_ARRIVED', 9990003, 27072660, 'DELIVER_SHELF', 'READY', '2026-03-26 22:20:36');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
